[
  {
    "department": "EDUC",
    "number": "65. ",
    "gen eds": "",
    "requirements": "",
    "description": "irst-Year Seminar: School Daze: What's School Got to do with Getting an Education?. 3 Credits.  This seminar explores the concepts of schooling and education. Students will be challenged to reconsider their experiences and notions about pre-K through 12 schooling and to examine alternatives.  "
  },
  {
    "department": "EDUC",
    "number": "89. ",
    "gen eds": "",
    "requirements": "",
    "description": "irst-Year Seminar: Special Topics. 3 Credits.  Course content will vary each semester.  Repeat rules: May be repeated for credit; may be repeated in the same term for different topics; 6 total credits. 2 total completions.  "
  },
  {
    "department": "EDUC",
    "number": "121",
    "gen eds": "",
    "requirements": "",
    "description": "Tutoring in the Schools I. 2 Credits.  Provides a basic introduction to teaching and education. This course consists of a seminar based with field placements in different levels of schools.  "
  },
  {
    "department": "EDUC",
    "number": "122",
    "gen eds": "",
    "requirements": "",
    "description": "Tutoring in the Schools II. 1 Credit.  Combines tutoring training with a field placement for tutoring in literacy and mathematics in grades kindergarten through three.  "
  },
  {
    "department": "EDUC",
    "number": "130",
    "gen eds": "",
    "requirements": "",
    "description": "Navigating the Research University. 1 Credit.  This course will provide students with knowledge to succeed at a research university. Students will consider what it means to have a liberal arts education and will learn about motivation, resiliency, and self-advocacy. Students will reflect on their current work toward academic success and their path to graduation.  "
  },
  {
    "department": "EDUC",
    "number": "131",
    "gen eds": "",
    "requirements": "",
    "description": "Career Exploration. 1 Credit.  Provides students an opportunity for exploration of career choices.  "
  },
  {
    "department": "EDUC",
    "number": "132",
    "gen eds": "",
    "requirements": "",
    "description": "Career Planning. 1 Credit.  This course is designed for juniors and seniors who are preparing to embark on their post-Carolina job search. Students will learn how to develop the necessary tools and skills required to execute an effective job search.  "
  },
  {
    "department": "EDUC",
    "number": "181",
    "gen eds": "",
    "requirements": "",
    "description": "Introduction to Human Development and Family Studies. 3 Credits.  Introduces students to theories and major research areas in human development and family studies while connecting this theory and research to careers in the helping professions. Students shadow a professional in a field of their choice.  "
  },
  {
    "department": "EDUC",
    "number": "190",
    "gen eds": "",
    "requirements": "",
    "description": "Special Topics in Education. 1-3 Credits.  This course provides students the opportunity for introductory exploration and discussion of selected topics in education.  Repeat rules: May be repeated for credit; may be repeated in the same term for different topics; 15 total credits. 5 total completions.  "
  },
  {
    "department": "EDUC",
    "number": "221",
    "gen eds": "",
    "requirements": "",
    "description": "Tutoring in the Schools III. 1 Credit.  Combines tutoring training with a field placement for tutoring in literacy and mathematics in grades four through eight.  "
  },
  {
    "department": "EDUC",
    "number": "222",
    "gen eds": "",
    "requirements": "",
    "description": "Tutoring in the Schools IV. 1 Credit.  Focuses on the relationship among arts, creativity, and education.  "
  },
  {
    "department": "EDUC",
    "number": "231",
    "gen eds": "SS, CI.  ",
    "requirements": "",
    "description": "Thrive@Carolina and Beyond. 3 Credits.  Learn about the science of thriving and strengths-based strategies for young adult development. The course will bridge contemporary literature on positive psychology (e.g., hope, optimism), developmental assets, resiliency, cultural competence, engagement/connectedness, positive youth development, and more. In particular, learn and work on thriving as a student at UNC-Chapel Hill.  "
  },
  {
    "department": "EDUC",
    "number": "250",
    "gen eds": "",
    "requirements": "",
    "description": "Risk and Resiliency: Challenges and Opportunities in Education. 4 Credits.  Explores factors that put children at risk for educational failure and interventions to increase resiliency. Service and learning experiences in educational and community agencies are integral to the course.  "
  },
  {
    "department": "EDUC",
    "number": "301",
    "gen eds": "SS, EE-Field Work.  ",
    "requirements": "",
    "description": "Junior Transfer Seminar - Thriving in Transition. 3 Credits.  Course challenges students to think critically about educational issues as they transition to a research university. Through readings, videos and activities, students explore the value of higher education, the development of intelligence, and the role of habit and happiness in college success. Students also conduct and present original qualitative research.  "
  },
  {
    "department": "EDUC",
    "number": "309",
    "gen eds": "",
    "requirements": "",
    "description": "An Examination of Quality and the Pursuit of Betterness. 3 Credits.  A three-credit seminar on leadership styles, philosophies, and issues related to leadership. Each class will overlap these concepts (topical or theory/practice, service, and self-awareness.)  "
  },
  {
    "department": "EDUC",
    "number": "316",
    "gen eds": "",
    "requirements": "",
    "description": "Advanced Leadership Development Seminar. 3 Credits.  This is a three-credit course with a focus on delving deeper into issues relevant to leadership and education. This course is open to seniors, juniors, and sophomores with student organization experience and an interest in an advanced exploration of leadership.  "
  },
  {
    "department": "EDUC",
    "number": "317",
    "gen eds": "",
    "requirements": "",
    "description": "Dynamics of Effective Leadership. 1 Credit.  The course is intended to provide an introduction to leadership theory, a forum for reflection upon personal strengths and contributions to leadership, and an opportunity to explore the nature of working in teams and groups.  "
  },
  {
    "department": "EDUC",
    "number": "318",
    "gen eds": "EE-Mentored Research.  ",
    "requirements": "",
    "description": "Peer Leadership in the University Environment. 2 Credits.  This course revolves around and centers on the Relational Leadership Model which defines leadership as the relational and ethical process of people together attempting to accomplish positive change.  "
  },
  {
    "department": "EDUC",
    "number": "330",
    "gen eds": "SS.  ",
    "requirements": "",
    "description": "The Science of Learning. 3 Credits.  Students study several facets of learning in the modern world, and investigate what scholarship in cognitive psychology, educational psychology, and the learning sciences can do to help us maximize that learning.  "
  },
  {
    "department": "EDUC",
    "number": "387",
    "gen eds": "",
    "requirements": "",
    "description": "Peer Tutoring. 3 Credits.  Peer Tutoring is an APPLES service-learning course that provides undergraduates the opportunity to serve fellow students through tutoring. Tutors must have an overall GPA of 3.0 or higher.  Repeat rules: May be repeated for credit. 6 total credits. 2 total completions.  "
  },
  {
    "department": "EDUC",
    "number": "390",
    "gen eds": "",
    "requirements": "",
    "description": "Special Topics in Education. 3 Credits.  This course provides students the opportunity for intensive exploration and discussion of selected topics in education.  Repeat rules: May be repeated for credit; may be repeated in the same term for different topics.  "
  },
  {
    "department": "EDUC",
    "number": "400",
    "gen eds": "EE-Service Learning.  ",
    "requirements": "",
    "description": "Autism in Our Communities: An Interdisciplinary Perspective. 3 Credits.  Students have 30 hours of service-learning with individuals with autism at community partner sites. Class discussions introduce students to diverse topics related to autism spectrum disorder. This is an APPLES course.  "
  },
  {
    "department": "EDUC",
    "number": "401",
    "gen eds": "",
    "requirements": "",
    "description": "Introduction to Early Childhood Development: Birth to Eight. 3 Credits.  This course examines the field of child development as it contributes to the teaching and learning of children in early childhood and elementary educational settings, ages birth to eight.  "
  },
  {
    "department": "EDUC",
    "number": "402",
    "gen eds": "",
    "requirements": "",
    "description": "Models of Early Childhood Service Delivery. 3 Credits.  This seminar serves as an introduction to the field of child development and early childhood education and special education. Students learn about the primary professional disciplines and agencies serving young children and their families. Current policy, recommended practices, and research innovations are reviewed.  "
  },
  {
    "department": "EDUC",
    "number": "403",
    "gen eds": "",
    "requirements": "",
    "description": "Families, Schools, and Community Services. 3 Credits.  This course examines issues of diversity among and across families, in order to better prepare students for human service fields in a variety of settings such as clinics, schools, advocacy, and other organizations.  "
  },
  {
    "department": "EDUC",
    "number": "404",
    "gen eds": "",
    "requirements": "Prerequisite, EDUC 401.  ",
    "description": "Infant/Toddler Assessment and Intervention. 3 Credits.  Restricted to majors. Permission of the instructor for nonmajors. Provides students with knowledge of program models and curricula/intervention strategies for working with infants and toddlers with and without disabilities. Information is provided regarding identification and assessment strategies for infants, toddlers, and two-year-olds. Program models for working with families are emphasized.  "
  },
  {
    "department": "EDUC",
    "number": "408",
    "gen eds": "",
    "requirements": "",
    "description": "Research Methods in Human Development. 3 Credits.  An introductory examination of human development and family research methods designed to provide an understanding of scientific inquiry, methodology, measurement, test construction, scaling, and statistical terms and techniques.  "
  },
  {
    "department": "EDUC",
    "number": "410",
    "gen eds": "",
    "requirements": "",
    "description": "Promotive Youth Services in Community and School Environments. 3 Credits.  This course is an exploration of the research and theory about programs that promote youth development and prevent youth problems in the central contexts where youth function (i.e., home, school, outside of school activities, sports, peer networks, etc.). Career options (e.g., social work, law enforcement, teaching, and community outreach work) will also be explored in real life work settings.  "
  },
  {
    "department": "EDUC",
    "number": "413",
    "gen eds": "",
    "requirements": "",
    "description": "Language and Literacy Learning. 3 Credits.  Permission of the instructor for nonmajors. This course covers the theoretical and developmental aspects of language and literacy processes and practices. The course will cover reading, writing, speaking, listening and viewing practices, birth to age 12.  "
  },
  {
    "department": "EDUC",
    "number": "416",
    "gen eds": "",
    "requirements": "",
    "description": "Curriculum Integration: Science, Math, and Technology. 3 Credits.  Permission of the instructor for nonmajors. The focus of this course is children's development in mathematical and scientific ways of knowing and the use of technology to support this development.  "
  },
  {
    "department": "EDUC",
    "number": "421",
    "gen eds": "",
    "requirements": "",
    "description": "Community Organizations and Children I. 1 Credit.  Provides an understanding of the community contexts of schools and an experience working in community group. This is the first semester of two-semester course.  "
  },
  {
    "department": "EDUC",
    "number": "422",
    "gen eds": "",
    "requirements": "Prerequisite, EDUC 421.  ",
    "description": "Community Organizations and Children II. 1 Credit.  Provides prospective teachers with an understanding of the community contexts of the schools. Second semester of a two-semester course.  "
  },
  {
    "department": "EDUC",
    "number": "441",
    "gen eds": "",
    "requirements": "",
    "description": "Education in American Society. 3 Credits.  A reflective examination of beliefs and attitudes associated with 1) the historical, philosophical, sociological, political, and economic forces affecting education and schooling in the United States; 2) the structure and function of the school system; and 3) current issues and trends in American schooling and education.  "
  },
  {
    "department": "EDUC",
    "number": "464",
    "gen eds": "",
    "requirements": "",
    "description": "Teaching Profession. 3 Credits.  Introduction to teaching. Course covers foundations and philosophies of education, current issues, and trends in public schooling.  "
  },
  {
    "department": "EDUC",
    "number": "465",
    "gen eds": "",
    "requirements": "",
    "description": "Introduction to Teaching. 2 Credits.  Offered concurrently with EDUC 466. Restricted to students admitted to the middle grades teacher education program. Initiates students into the teaching profession. The course stresses what it is like to be a teacher, with concurrent emphasis on the life of the student and the study of schools.  "
  },
  {
    "department": "EDUC",
    "number": "466",
    "gen eds": "",
    "requirements": "",
    "description": "Planning for Teaching in the Middle Grades. 3 Credits.  Offered concurrently with EDUC 465. Restricted to students admitted to the middle grades teacher education program. Helps students learn how to plan and develop skills to meet the unique and diverse needs of young adolescents as they prepare to teach.  "
  },
  {
    "department": "EDUC",
    "number": "469",
    "gen eds": "EE-Field Work.  ",
    "requirements": "Prerequisites, EDUC 465 and 466.  ",
    "description": "Developing Skills for Teaching. 3 Credits.  Helps students develop a variety of basic teaching skills used by classroom teachers. This course will be conducted primarily as a laboratory course.  "
  },
  {
    "department": "EDUC",
    "number": "493",
    "gen eds": "EE-Field Work.  ",
    "requirements": "",
    "description": "Practicum. 1-6 Credits.  Permission of the instructor for nonmajors. Students gain familiarity with the operations and complexity of teaching. Students observe instruction, assist in teaching, learn about the curriculum and specific resources, interact with school personnel, work with students, and apply skills learned in previous courses. Prepares students for internship or student teaching.  Repeat rules: May be repeated for credit; may be repeated in the same term for different topics.  "
  },
  {
    "department": "EDUC",
    "number": "496",
    "gen eds": "",
    "requirements": "",
    "description": "Independent Study. 1-3 Credits.  Permission of the instructor. Provides readings and research under the direction of a faculty member. May be repeated for a maximum of six credit hours.  Repeat rules: May be repeated for credit; may be repeated in the same term for different topics; 12 total credits. 4 total completions.  "
  },
  {
    "department": "EDUC",
    "number": "503",
    "gen eds": "",
    "requirements": "",
    "description": "Leadership Seminar. 1-3 Credits.  Course asks students to consider what it means to participate in schools as educational leaders. Students consider how to collaborate effectively with school colleagues, advocate for children and families, participate in the politics of schools and education, and examine what it means to be change agents in classrooms and schools.  "
  },
  {
    "department": "EDUC",
    "number": "504",
    "gen eds": "SS.  ",
    "requirements": "",
    "description": "Learning in the Modern World. 3 Credits.  Students learn about current educational emphases and controversies as well as what the research and scholarship in the fields of education and cognition can contribute to our understanding of these phenomena.  "
  },
  {
    "department": "EDUC",
    "number": "505",
    "gen eds": "SS.  ",
    "requirements": "",
    "description": "Leadership in Educational/Nonprofit Settings. 3 Credits.  Introduces students to a research-based, highly practical understanding of leadership frames/styles prominent in educational/nonprofit organizations. Emphasizes continued student engagement with various leadership models and principles.  "
  },
  {
    "department": "EDUC",
    "number": "506",
    "gen eds": "SS.  ",
    "requirements": "",
    "description": "Politics, Policymaking, and America's Schools. 3 Credits.  Through extensive case study and conversations with policy actors, students will learn the stages model of policy making and understand conflicting values that play out in policy decisions.  "
  },
  {
    "department": "EDUC",
    "number": "508",
    "gen eds": "SS, GL.  ",
    "requirements": "",
    "description": "Equity, Leadership, and You. 3 Credits.  This course was developed to confront and address questions of global cultural competence and self-critique. Culturally competent leaders work to understand their own biases and patterns of discrimination.  "
  },
  {
    "department": "EDUC",
    "number": "509",
    "gen eds": "SS.  ",
    "requirements": "",
    "description": "Helping Youth Thrive in K-12 Schools. 3 Credits.  Learn strengths-oriented approaches in education practice, research, and policy. The course takes up contemporary literature on positive psychology, developmental assets, resiliency, cultural competence, school readiness, school engagement/ connectedness, and positive youth development.  "
  },
  {
    "department": "EDUC",
    "number": "510",
    "gen eds": "HS, US.  ",
    "requirements": "",
    "description": "Mexican American and Chicana/o Experience in Education. 3 Credits.  This course examines the political, cultural, and historical dimensions of the Mexican American and Chicana/o experience in education. A critical exploration of K-12 schools, higher education, and various social initiatives intended to address inequities in education for Mexican Americans and Chicanas/os will also be a focus of this class.  "
  },
  {
    "department": "EDUC",
    "number": "511",
    "gen eds": "",
    "requirements": "",
    "description": "Politics of Reading. 3 Credits.  Course explores the politics and policies involved in literacy curriculum and pedagogy. Critical policy analysis is used as a tool to explore and understand the political issues involved in teaching young children to read and write.  "
  },
  {
    "department": "EDUC",
    "number": "513",
    "gen eds": "",
    "requirements": "",
    "description": "Methods for Teaching in the Elementary School. 3-9 Credits.  Permission of the instructor for nonmajors. This methods block is a field based, integrated collection of science, literacy, and math courses designed to prepare pre-service teachers for planning and implementing instruction in elementary schools.  Repeat rules: May be repeated for credit; may be repeated in the same term for different topics.  "
  },
  {
    "department": "EDUC",
    "number": "515",
    "gen eds": "",
    "requirements": "",
    "description": "The Arts as Integrative Teaching. 2 Credits.  Restricted to students admitted to the elementary education program or the child development and family studies program. Explores integration of the arts in the curriculum.  "
  },
  {
    "department": "EDUC",
    "number": "516",
    "gen eds": "",
    "requirements": "",
    "description": "Introduction to the Education of Exceptional Learners. 3 Credits.  Offers an overview of the special education field and its relevance to the classroom teacher. The course is based on an interdisciplinary perspective toward serving exceptional learners and collaboratively coordinating services. Course content emphasizes inclusive programming and the teacher's role in facilitating students' unique learning needs.  "
  },
  {
    "department": "EDUC",
    "number": "519",
    "gen eds": "",
    "requirements": "Prerequisite, EDUC 593.  ",
    "description": "Senior Seminar. 3 Credits.  Course is restricted to majors. Permission of the instructor for nonmajors. The senior seminar is inquiry based and directly connects student teachers with classroom practices. Throughout the semester student teachers develop and implement inquiry projects.  "
  },
  {
    "department": "EDUC",
    "number": "520",
    "gen eds": "",
    "requirements": "",
    "description": "Early Language and Literacy Learning-Birth to Third Grade. 3 Credits.  Course is restricted to majors. Permission of the instructor for nonmajors. Course focuses on the language, reading, and writing development of children birth through third grade. Promotes early literacy learning for all children with and without disabilities, including those at risk.  "
  },
  {
    "department": "EDUC",
    "number": "521",
    "gen eds": "",
    "requirements": "",
    "description": "Schools, Cultures, and Communities I: Youth. 3 Credits.  Focus on youth in schools. This course considers the history and present lives of youth, primarily as teenagers/adolescents. It seeks recognition and understanding of the uniqueness of their lives.  "
  },
  {
    "department": "EDUC",
    "number": "522",
    "gen eds": "",
    "requirements": "",
    "description": "Schools, Cultures, and Communities II: Schools. 3 Credits.  Course focuses on schools and educational issues as they relate to practices and policies. Fulfills central ideas of the minor in education in consideration of the history and present conditions of schooling in a democratic society.  "
  },
  {
    "department": "EDUC",
    "number": "523",
    "gen eds": "",
    "requirements": "",
    "description": "Teaching Early Mathematics-Birth to Third Grade. 3 Credits.  Course is restricted to majors. Permission of the instructor for nonmajors. Students study the teaching and learning of mathematics for young children, birth to third grade. Emphasis is placed on content for math, as well as materials, techniques, and teaching aids.  "
  },
  {
    "department": "EDUC",
    "number": "524",
    "gen eds": "EE-Field Work.  ",
    "requirements": "",
    "description": "Learning on the Edge: Theories of Experiential Education. 3 Credits.  This course examines experiential education in a variety of settings. Students will explore the role experiential education currently plays and suggest new roles in a chosen field of study.  "
  },
  {
    "department": "EDUC",
    "number": "525",
    "gen eds": "SS.  ",
    "requirements": "",
    "description": "Human Abilities and Online Learning. 3 Credits.  Learn about the scientific basis of thinking and learning and what this implies for guiding children and adults, for personal development and for building environments that help people learn and grow successfully in a rapidly changing technological world.  "
  },
  {
    "department": "EDUC",
    "number": "526",
    "gen eds": "",
    "requirements": "",
    "description": "Ethics and Education: From Global Problems to Classroom Dilemmas. 3 Credits.  Among the topics examined are ethical implications of democratic schooling for a democratic society, educators as moral agents, and education as an institution with incumbent responsibilities. Students explore the explicit and implied ethics of education and schooling as they relate to policy makers, educators, and citizens concerned about social justice.  "
  },
  {
    "department": "EDUC",
    "number": "527",
    "gen eds": "",
    "requirements": "",
    "description": "Screen Education: Representations of Education in Popular Culture. 3 Credits.  Explore and analyze how education has been represented in popular culture. \"Education\" refers to teachers, students, principals, other educators, and the everyday processes of schooling, and \"popular culture\" refers to school films (fictional films), school documentaries, television shows, music videos and song lyrics, animation, and other media forms.  "
  },
  {
    "department": "EDUC",
    "number": "529",
    "gen eds": "HS, CI.  ",
    "requirements": "",
    "description": "Education in American Society. 3 Credits.  Explore history of American schools to inform students' understandings of contemporary schools. Examine policies, issues, and controversies through a chronological examination of schools and society.  "
  },
  {
    "department": "EDUC",
    "number": "531",
    "gen eds": "",
    "requirements": "",
    "description": "Effective Teaching: First Steps. 2 Credits.  Characteristics of effective teachers, classroom management, instructional methods, instructional planning and presentation, monitoring and assessing student behavior and learning, differentiating instruction, yearly plans and pacing guides.  "
  },
  {
    "department": "EDUC",
    "number": "532",
    "gen eds": "SS.  ",
    "requirements": "",
    "description": "Introduction to Development and Learning. 3 Credits.  This course examines the field of human development as it contributes to the teaching and learning of all children. The emphasis is on understanding the nature of development in educational contexts and the implications of research and theory on human development for teacher practice and the creation of supportive learning environments for all children.  "
  },
  {
    "department": "EDUC",
    "number": "533",
    "gen eds": "SS, US.  ",
    "requirements": "",
    "description": "Social Justice in Education. 3 Credits.  Course examines how education can help create more fair and just societies, ultimately contributing to high performing educational systems internationally. Students explore multiple perspectives on social justice; examine efforts at local, state, national, and global levels; and learn to articulate efforts in classrooms and schools with wider community initiatives.  "
  },
  {
    "department": "EDUC",
    "number": "534",
    "gen eds": "",
    "requirements": "",
    "description": "Effective Teaching: Assessment. 2 Credits.  Methods of assessment, multiple measures, monitoring student performance to inform and improve instruction, understanding students with special needs with individual education plans, test scores, and other information in student files.  "
  },
  {
    "department": "EDUC",
    "number": "535",
    "gen eds": "",
    "requirements": "",
    "description": "Teachers and Schools. 3 Credits.  Leadership in classroom and school with families, standards of practice, advocating equity, supporting teaching profession, school organization, school finance, legal issue/education strategies for environments that promote learning, issues and trends.  "
  },
  {
    "department": "EDUC",
    "number": "540",
    "gen eds": "",
    "requirements": "",
    "description": "Mathematics Teaching. 2 Credits.  NCTM Standards, Standard Course of Study, developing student understanding of mathematics, problem-solving skills, and professional commitment.  "
  },
  {
    "department": "EDUC",
    "number": "541",
    "gen eds": "",
    "requirements": "",
    "description": "Mathematics Problems for Instruction. 2 Credits.  Mathematical tasks for learners in grades six through 12 and instructional methods necessary to maintain a task at a high cognitive level.  "
  },
  {
    "department": "EDUC",
    "number": "542",
    "gen eds": "",
    "requirements": "",
    "description": "Planning for Mathematics Instruction. 2 Credits.  Examining patterns of practice and assessment, modifying and improving planned units, pacing instruction, reconsidering individual differences and differentiation.  "
  },
  {
    "department": "EDUC",
    "number": "550",
    "gen eds": "",
    "requirements": "",
    "description": "Science Teaching. 2 Credits.  Nature of science, national science standards, teaching science as inquiry, safety in the science classroom, materials management.  "
  },
  {
    "department": "EDUC",
    "number": "551",
    "gen eds": "",
    "requirements": "Prerequisite, EDUC 550.  ",
    "description": "Designing Science Tasks. 2 Credits.  Developing and redesigning science instruction to engage students actively, with emphasis on classroom management for energetic curricula, modifying tasks and projects, assessment strategies, and utilization of resources.  "
  },
  {
    "department": "EDUC",
    "number": "552",
    "gen eds": "",
    "requirements": "Prerequisite, EDUC 551.  ",
    "description": "Improving Science Instruction. 2 Credits.  A practitioner's look at instruction in middle and high school science classrooms using many current pedagogical approaches of instruction: constructivism, models of inquiry, reflective practice, and conceptual change theory.  "
  },
  {
    "department": "EDUC",
    "number": "555",
    "gen eds": "",
    "requirements": "",
    "description": "Constructive Coaching I: Starting Out Right. 1 Credit.  Designed to support lateral entry candidates, solving the most urgent problems in the classroom. Includes frequent online communication, individualized attention to immediate problems and combines supervision, coaching, and mentoring.  "
  },
  {
    "department": "EDUC",
    "number": "556",
    "gen eds": "",
    "requirements": "Prerequisite, EDUC 555.  ",
    "description": "Constructive Coaching II: Effective Management of Student Behavior. 1 Credit.  Course designed to help lateral entry candidates by improving their classroom management skills, specifically those related to student behavior.  "
  },
  {
    "department": "EDUC",
    "number": "557",
    "gen eds": "",
    "requirements": "Prerequisite, EDUC 556.  ",
    "description": "Constructive Coaching III: Helping Students Learn. 3 Credits.  Course designed to support the lateral entry candidates through individualized feedback about concerns, focusing on strategies for increasing student learning using content area literacy strategies.  "
  },
  {
    "department": "EDUC",
    "number": "560",
    "gen eds": "",
    "requirements": "",
    "description": "Second Language Teaching. 2 Credits.  Methods of teaching a second language, how people learn foreign languages, planning instruction, getting students to communicate, using and adapting foreign language textbooks, and developing lessons.  "
  },
  {
    "department": "EDUC",
    "number": "561",
    "gen eds": "",
    "requirements": "",
    "description": "Designing Second Language Tasks. 2 Credits.  Students examine instruction as effective mechanism for classroom management, choosing and redesigning tasks and projects to engage students in active learning. Assessment of student understanding investigated as necessary for development of effective instruction.  "
  },
  {
    "department": "EDUC",
    "number": "562",
    "gen eds": "",
    "requirements": "",
    "description": "Improving Second Language Instruction. 2 Credits.  Students will consider national standards frameworks as organizing principles for instructional strategies. They will develop skills by use of culturally authentic materials, performance-based assessment, and units and lessons promoting successful language learning.  "
  },
  {
    "department": "EDUC",
    "number": "563",
    "gen eds": "",
    "requirements": "",
    "description": "Teaching Language Arts in the Middle Grades. 3 Credits.  Restricted to students admitted to the middle grades education program. Focuses on the goals and methods of teaching language arts in the middle grades, including planning for student diversity and unit planning.  "
  },
  {
    "department": "EDUC",
    "number": "564",
    "gen eds": "",
    "requirements": "",
    "description": "Teaching Social Studies in the Middle Grades. 3 Credits.  Restricted to students admitted to the middle grades education program. Focuses on the goals and methods of teaching social studies in the middle grades.  "
  },
  {
    "department": "EDUC",
    "number": "565",
    "gen eds": "",
    "requirements": "",
    "description": "Teaching Science in the Middle Grades. 3 Credits.  Restricted to students admitted to the middle grades education program. Focuses on methods for teaching science in the middle grades and includes emphasis on the individual needs of students, reading and writing in the content area, and unit planning.  "
  },
  {
    "department": "EDUC",
    "number": "566",
    "gen eds": "",
    "requirements": "",
    "description": "Teaching Math in the Middle Grades. 3 Credits.  Restricted to students admitted to the middle grades education program. Focuses on methods for teaching mathematics in the middle grades and includes emphasis on the individual needs of students, reading and writing in the content area, and unit planning.  "
  },
  {
    "department": "EDUC",
    "number": "567",
    "gen eds": "LA, CI.  ",
    "requirements": "",
    "description": "Children's Literature in Elementary and Middle Schools. 3 Credits.  Explores literature in the contexts of interdisciplinary elementary and middle school curricula and the interests and needs of children and young adolescents. Topics include reader-response theory, censorship, Internet resources, school resources, and methods.  "
  },
  {
    "department": "EDUC",
    "number": "568",
    "gen eds": "",
    "requirements": "Prerequisites, EDUC 465, 466, and 469; corequisite, EDUC 593.  ",
    "description": "Seminar on Teaching. 3 Credits.    "
  },
  {
    "department": "EDUC",
    "number": "583",
    "gen eds": "EE-Service Learning.  ",
    "requirements": "",
    "description": "Planning the Internship Experience. 3 Credits.  This course provides an integrative learning experience which prepares HDFS students to apply academic learning acquired in previous coursework to real-life situations likely to be encountered in the internship experience and throughout their careers in the field of human services. Course materials and learning experiences are intended to help students obtain an internship.  "
  },
  {
    "department": "EDUC",
    "number": "593",
    "gen eds": "EE-Academic Internship.  ",
    "requirements": "",
    "description": "Internship/Student Teaching. 1-12 Credits.  Internships are full-time, authentic, field-based experiences in an educational or professional setting. Preservice teachers are responsible for planning lessons, delivering instruction, assessing students, managing the classroom, and demonstrating their teaching effectiveness. All internships are devoted exclusively to the student's functioning in a professional capacity.  Repeat rules: May be repeated for credit; may be repeated in the same term for different topics; 12 total credits. 2 total completions.  "
  },
  {
    "department": "EDUC",
    "number": "595",
    "gen eds": "",
    "requirements": "",
    "description": "Introduction to Exceptional Children. 3 Credits.  Permission of the instructor for nonmajors. Surveys giftedness and mental disabilities, emotional and behavioral disorders, learning disabilities, speech, hearing, vision, and physical impairments. Emphasizes the role of professionals, families, and the community in supporting the whole child.  "
  },
  {
    "department": "EDUC",
    "number": "601",
    "gen eds": "",
    "requirements": "",
    "description": "Education Workshops. 1-3 Credits.  Permission of the program director. Workshops designed around education topics primarily for licensed K-12 teachers.  Repeat rules: May be repeated for credit; may be repeated in the same term for different topics; 12 total credits. 5 total completions.  "
  },
  {
    "department": "EDUC",
    "number": "614",
    "gen eds": "",
    "requirements": "",
    "description": "Innovative and Engaging Teaching. 3 Credits.  Introduction to the teaching profession including a focused, program-long emphasis on innovative, authentic, and resource-informed teaching. Includes engagement with 21st-century learning skills.  "
  },
  {
    "department": "EDUC",
    "number": "615",
    "gen eds": "EE-Field Work, US.  ",
    "requirements": "",
    "description": "Schools and Community Collaboration. 3 Credits.  Course explores the symbiotic relationship between schools, families, and communities through a historical and sociocultural lens. Students participate in a community-based field experience.  "
  },
  {
    "department": "EDUC",
    "number": "616",
    "gen eds": "",
    "requirements": "",
    "description": "Teaching Early English Language Arts. 3 Credits.  Course focuses on ELA pedagogy, grades kindergarten through second grade. Course emphasizes best practices in foundations of reading and writing, cross-disciplinary concepts, and meaningful inquiry-based learning experiences.  "
  },
  {
    "department": "EDUC",
    "number": "617",
    "gen eds": "SS, EE-Service Learning.  ",
    "requirements": "",
    "description": "Teaching in the Middle School. 3 Credits.  Provides students with an introduction to the history, philosophy, and attributes of schools and curriculum specifically designed for young adolescents with attention to their developmental characteristics and needs as learners.  "
  },
  {
    "department": "EDUC",
    "number": "626",
    "gen eds": "",
    "requirements": "",
    "description": "Pedagogical English Grammar for ESL Teachers. 3 Credits.  Enhances foreign and second language educators' understanding of English grammar, expands their skills in linguistic analysis, and helps them develop a more pedagogically sound approach to the teaching of English grammar.  "
  },
  {
    "department": "EDUC",
    "number": "627",
    "gen eds": "",
    "requirements": "",
    "description": "Pedagogical Linguistics for ESL Teachers. 3 Credits.  Provides future English as a second language teachers with advanced concepts in linguistics and comparative linguistics. Topics such as phonology and morphology will be covered.  "
  },
  {
    "department": "EDUC",
    "number": "628",
    "gen eds": "US.  ",
    "requirements": "",
    "description": "Teaching English Language Learners. 3 Credits.  Provides students with an introduction to the history, philosophy, and attributes of schools and curriculum specifically designed for young adolescents with attention to their developmental characteristics and needs as learners.  "
  },
  {
    "department": "EDUC",
    "number": "629",
    "gen eds": "",
    "requirements": "",
    "description": "Language Minority Students: Issues for Practitioners. 3 Credits.  Permission of the instructor. Explores issues of culture and language associated with teaching English as a second language.  "
  },
  {
    "department": "EDUC",
    "number": "685",
    "gen eds": "",
    "requirements": "",
    "description": "Teaching Mathematics in the Elementary Grades. 3 Credits.  This course emphasizes the interconnection of a classroom/school and society, the role of cultural beliefs in education, and mathematics instruction.  "
  },
  {
    "department": "EDUC",
    "number": "686",
    "gen eds": "",
    "requirements": "",
    "description": "Teaching Science in the Elementary Grades. 3 Credits.  This course emphasizes the interconnection of classroom/school and society, the role of cultural beliefs in education, and science instruction.  "
  },
  {
    "department": "EDUC",
    "number": "687",
    "gen eds": "",
    "requirements": "",
    "description": "Teaching Social Studies in the Elementary Grades. 3 Credits.  This course emphasizes the interconnection of classroom/school and society, the role of cultural beliefs in education, and social studies instruction.  "
  },
  {
    "department": "EDUC",
    "number": "688",
    "gen eds": "",
    "requirements": "",
    "description": "Teaching Intermediate English Language Arts, Grades 3-6. 3 Credits.  This course emphasizes the interconnection of classroom/school and society, the role of cultural beliefs in education, and English language arts instruction.  "
  },
  {
    "department": "EDUC",
    "number": "689",
    "gen eds": "",
    "requirements": "",
    "description": "Foundations of Special Education. 3 Credits.  This course provides an advanced introduction to key concepts, issues, and service delivery approaches pertaining to the educational needs of students with high incidence disabilities.  "
  },
  {
    "department": "EDUC",
    "number": "691H",
    "gen eds": "EE-Mentored Research.  ",
    "requirements": "",
    "description": " Honors Seminar in Education. 3 Credits.  Restricted to honors candidates in the School of Education. Required for graduation with honors in education. Integration of critical analysis of selected educational themes, introduction to methods of educational research, and intensive work in skills of reading critically and writing.  "
  },
  {
    "department": "EDUC",
    "number": "693",
    "gen eds": "",
    "requirements": "",
    "description": "Practica Student Internship. 1-12 Credits.  Provides students the opportunity to observe and become involved with all aspects of teaching and schools within their content area.  Repeat rules: May be repeated for credit; may be repeated in the same term for different topics; 12 total credits. 2 total completions.  "
  },
  {
    "department": "EDUC",
    "number": "694H",
    "gen eds": "EE-Mentored Research.  ",
    "requirements": "Prerequisite, EDUC 691H; A grade of B or better in EDUC 691H is required to take this course.  ",
    "description": " Honors Thesis in Education. 3 Credits.  Required of all candidates for graduation with honors in education. Preparation of an honors thesis under the direction of a member of the School of Education faculty and an oral examination on the thesis.  "
  },
  {
    "department": "EDUC",
    "number": "697",
    "gen eds": "EE-Mentored Research.  ",
    "requirements": "",
    "description": "Education Minor Capstone Course. 3 Credits.  Student completes a major project in education. Course involves discussion about the changing and contested goals of education, how student projects are implicated in these complexities, and how the projects may be articulated in terms of policy change.  "
  }
]