[
  {
    "department": "INLS",
    "number": "73. ",
    "gen eds": "",
    "requirements": "",
    "description": "irst-Year Seminar: Smart Cities. 3 Credits.   Topics and trends in sustainable and smart cities. Role of information in the design of network resources and impact on urban design, development, and urban living will be explored.   "
  },
  {
    "department": "INLS",
    "number": "89. ",
    "gen eds": "",
    "requirements": "",
    "description": "irst-Year Seminar: Special Topics. 3 Credits.   Special topics course; content will vary each semester.   Repeat rules: May be repeated for credit; may be repeated in the same term for different topics; 6 total credits. 2 total completions.   "
  },
  {
    "department": "INLS",
    "number": "151",
    "gen eds": "SS.   ",
    "requirements": "",
    "description": "Retrieving and Analyzing Information. 3 Credits.   Introduction to and application of the processes that can be used in seeking information, evaluating the quality of the information retrieved, and synthesizing the information into a useful form.   "
  },
  {
    "department": "INLS",
    "number": "161",
    "gen eds": "",
    "requirements": "",
    "description": "Tools for Information Literacy. 3 Credits.   Tools and concepts for information literacy. Includes software use and maintenance, computer applications, and networked information systems.   "
  },
  {
    "department": "INLS",
    "number": "201",
    "gen eds": "SS.   ",
    "requirements": "",
    "description": "Foundations of Information Science. 3 Credits.   Examines the evolution of information science; information representation, organization and management; search and retrieval; human information seeking and interaction; organizational behavior and communication; policy, ethics and scholarly communication.   "
  },
  {
    "department": "INLS",
    "number": "202",
    "gen eds": "",
    "requirements": "Prerequisite, INLS 201.   ",
    "description": "Retrieval and Organizing Systems. 3 Credits.   Introduction to foundational core concepts and core techniques in information organization, information retrieval, and data mining.   "
  },
  {
    "department": "INLS",
    "number": "203",
    "gen eds": "",
    "requirements": "Prerequisite, INLS 201.   ",
    "description": "Human Information Behavior. 3 Credits.   Introduces key areas and concepts in information science, to include task modeling, information-seeking behavior, search behavior, human-computer interaction, usability, user interfaces, social media, and social media analysis.   "
  },
  {
    "department": "INLS",
    "number": "318",
    "gen eds": "",
    "requirements": "Prerequisite, INLS 382.   ",
    "description": "Human Computer Interaction. 3 Credits.   Design, implementation, and evaluation of interfaces for computer systems. User-based techniques, usability issues, and human factors.   "
  },
  {
    "department": "INLS",
    "number": "382",
    "gen eds": "",
    "requirements": "Pre- or corequisite, INLS 161.   ",
    "description": "Information Systems Analysis and Design. 3 Credits.   Analysis of organizational problems and how information systems can be designed to solve those problems. Application of database and interface design principles to the implementation of information systems.Students may not receive credit for both INLS 382 and INLS 582.   "
  },
  {
    "department": "INLS",
    "number": "384",
    "gen eds": "PH, CI.   ",
    "requirements": "Prerequisite, INLS 201.   ",
    "description": "Information and Computer Ethics. 3 Credits.   Overview of ethical reasoning, followed by examination of ethical issues relevant to information science, including access to information and technology, societal impacts of technology, information privacy, surveillance and security, intellectual property, and professional ethics.   "
  },
  {
    "department": "INLS",
    "number": "385",
    "gen eds": "",
    "requirements": "",
    "description": "Information Use for Organizational Effectiveness. 3 Credits.   Basic concepts in the way that information, people, and technology interact to influence organizational effectiveness. Principles of problem solving, teamwork, leadership, and organizational change/innovation.   "
  },
  {
    "department": "INLS",
    "number": "393",
    "gen eds": "EE-Academic Internship.   ",
    "requirements": "",
    "description": "Information Science Internship. 3 Credits.   Permission of the school. Supervised observation and practice in information science. The internship typically takes place in an information agency or an information technology company. Faculty-led seminars and a paper enhance the experience. Pass/Fail only.   "
  },
  {
    "department": "INLS",
    "number": "396",
    "gen eds": "",
    "requirements": "",
    "description": "Independent Study in Information Systems. 1-3 Credits.   Study by an individual student on a special topic under the direction of a specific faculty member. A prospectus/plan for the work is required in advance of registration.   Repeat rules: May be repeated for credit. 6 total credits. 2 total completions.   "
  },
  {
    "department": "INLS",
    "number": "418",
    "gen eds": "",
    "requirements": "Prerequisite, INLS 382.   ",
    "description": "Human Factors in System Design. 3 Credits.   Design, implementation, and evaluation of interfaces for computer systems. User-based techniques, usability issues, and human factors.   "
  },
  {
    "department": "INLS",
    "number": "465",
    "gen eds": "",
    "requirements": "",
    "description": "Understanding Information Technology for Managing Digital Collections. 3 Credits.   Prepares students to be conversant with information technologies that underlie digital collections in order to evaluate the work of developers, delegate tasks, write requests for proposals, and establish policies and procedures. Teaches students how to think about information technology systems and recognize and manage interdependencies between parts of the systems.   "
  },
  {
    "department": "INLS",
    "number": "490",
    "gen eds": "",
    "requirements": "",
    "description": "Selected Topics. 1-3 Credits.   Exploration of an introductory-level special topic not otherwise covered in the curriculum. Previous offerings of these courses do not predict their future availability; new courses may replace these.   Repeat rules: May be repeated for credit; may be repeated in the same term for different topics; 9 total credits. 3 total completions.   "
  },
  {
    "department": "INLS",
    "number": "500",
    "gen eds": "",
    "requirements": "",
    "description": "Human Information Interactions. 3 Credits.   The behavioral and cognitive activities of those who interact with information, with emphasis on the role of information mediators. How information needs are recognized and resolved; use and dissemination of information.   "
  },
  {
    "department": "INLS",
    "number": "501",
    "gen eds": "",
    "requirements": "",
    "description": "Information Resources and Services. 3 Credits.   Analysis, use, and evaluation of information and reference systems, services, and tools for both printed and electronic delivery. Provides a foundation in electronic information search techniques, question negotiation, interviewing, and instruction.   "
  },
  {
    "department": "INLS",
    "number": "502",
    "gen eds": "",
    "requirements": "Prerequisite, INLS 501; permission of the instructor for students lacking the prerequisite.   ",
    "description": "User Education. 3 Credits.   Examines the history and context of LIS training programs. Pedagogy, teaching skills, methods of evaluation are addressed. Students may tailor learning projects to their own interests.   "
  },
  {
    "department": "INLS",
    "number": "503",
    "gen eds": "",
    "requirements": "",
    "description": "Communication Skills for Information Professionals. 3 Credits.   Through individual presentations, group exercises, and performance-centered feedback, this course seeks to improve students' ability to communicate their ideas clearly and present themselves positively in a professional setting.   "
  },
  {
    "department": "INLS",
    "number": "509",
    "gen eds": "",
    "requirements": "",
    "description": "Information Retrieval. 3 Credits.   Study of information retrieval and question answering techniques, including document classification, retrieval and evaluation techniques, handling of large data collections, and the use of feedback.   "
  },
  {
    "department": "INLS",
    "number": "512",
    "gen eds": "",
    "requirements": "Prerequisite, COMP 110, 116, or 121.   ",
    "description": "Applications of Natural Language Processing. 3 Credits.   Study of applications of natural language processing techniques and the representations and processes needed to support them. Topics include interfaces, text retrieval, machine translation, speech processing, and text generation.   "
  },
  {
    "department": "INLS",
    "number": "513",
    "gen eds": "",
    "requirements": "",
    "description": "Resource Selection and Evaluation. 3 Credits.   Identification, provision, and evaluation of resources to meet primary needs of clientele in different institutional environments.   "
  },
  {
    "department": "INLS",
    "number": "515",
    "gen eds": "",
    "requirements": "",
    "description": "Consumer Health Information. 3 Credits.   Examines concepts of health, health conditions, policy, and information collections and services from social and cultural perspectives. Analysis and design for provision and access to consumer health information services.   "
  },
  {
    "department": "INLS",
    "number": "520",
    "gen eds": "",
    "requirements": "",
    "description": "Organization of Information. 3 Credits.   Introduction to the problems and methods of organizing information, including information structures, knowledge schemata, data structures, terminological control, index language functions, and implications for searching.   "
  },
  {
    "department": "INLS",
    "number": "523",
    "gen eds": "",
    "requirements": "Pre- or corequisite, INLS 161.   ",
    "description": "Introduction to Database Concepts and Applications. 3 Credits.   Design and implementation of basic database systems. Semantic modeling, relational database theory, including normalization, indexing, and query construction, SQL.   "
  },
  {
    "department": "INLS",
    "number": "525",
    "gen eds": "",
    "requirements": "",
    "description": "Electronic Records Management. 3 Credits.   Explores relationships between new information and communication technologies and organizational efforts to define, identify, control, manage, and preserve records. Considers the importance of organizational, institutional and technological factors in determining appropriate recordkeeping strategies.   "
  },
  {
    "department": "INLS",
    "number": "530",
    "gen eds": "",
    "requirements": "",
    "description": "Young Adult Literature and Related Materials. 3 Credits.   A survey of print and nonprint library materials particularly suited to the needs of adolescents.   "
  },
  {
    "department": "INLS",
    "number": "534",
    "gen eds": "",
    "requirements": "",
    "description": "Youth and Technology in Libraries. 3 Credits.   This course encourages students to explore the array of technologies available to children and adolescents, the issues surrounding the use of technology, the role of care givers, and potential impacts on development.   "
  },
  {
    "department": "INLS",
    "number": "539",
    "gen eds": "",
    "requirements": "",
    "description": "Going the Last Mile: Information Access for Underserved Populations. 3 Credits.   In this course we investigate the special challenges of providing information services to marginalized populations in an increasingly digital world.   "
  },
  {
    "department": "INLS",
    "number": "540",
    "gen eds": "",
    "requirements": "",
    "description": "Building a Personal Digital Library. 3 Credits.   Students will implement a personal digital LifeTime Library. Topics include creation of a personal digital library, organization of the material, creation of descriptive metadata, management, and sharing of the collection.   "
  },
  {
    "department": "INLS",
    "number": "541",
    "gen eds": "",
    "requirements": "",
    "description": "Information Visualization. 3 Credits.   An introduction to information visualization through reading current literature and studying exemplars. The course reviews information visualization techniques, provides a framework for identifying the need for information visualization, and emphasizes interactive electronic visualizations that use freely available tools. Students will construct several visualizations. No programming skills are required.   "
  },
  {
    "department": "INLS",
    "number": "550",
    "gen eds": "",
    "requirements": "",
    "description": "History of the Book and Other Information Formats. 3 Credits.   The history of the origin and development of the book in all its formats: clay tablets to electronic. Coverage includes scientific and other scholarly publications, religious works, popular literature, periodicals, and newspapers.   "
  },
  {
    "department": "INLS",
    "number": "551",
    "gen eds": "",
    "requirements": "",
    "description": "History of Libraries and Other Information-Related Cultural Institutions. 3 Credits.   The history of cultural institutions related to information from earliest times to the present day. Includes specific institutions, trends in service and facilities, and individuals important in the development of these institutions.   "
  },
  {
    "department": "INLS",
    "number": "554",
    "gen eds": "",
    "requirements": "",
    "description": "Cultural Institutions. 3 Credits.   This course will explore cultural institutions--libraries, museums, parks, zoological and botanical gardens, reconstructions and other settings--as lifelong educational environments.   "
  },
  {
    "department": "INLS",
    "number": "556",
    "gen eds": "",
    "requirements": "",
    "description": "Introduction to Archives and Records Management. 3 Credits.   Survey of the principles, techniques, and issues in the acquisition, management, and administration of records, manuscripts, archives, and other cultural and documentary resources in paper, electronic, and other media formats.   "
  },
  {
    "department": "INLS",
    "number": "558",
    "gen eds": "",
    "requirements": "",
    "description": "Principles and Techniques of Storytelling. 3 Credits.   An overview of storytelling, its historical development, and the presentation and administration of storytelling programs. The class focuses on performance skills merged with theoretical issues.   "
  },
  {
    "department": "INLS",
    "number": "560",
    "gen eds": "",
    "requirements": "",
    "description": "Programming for Information Science. 3 Credits.   Introduction to programming and computational concepts. Students will learn to write programs using constructs such as iteration, flow control, variables, functions, and error handling. No programming experience required.   "
  },
  {
    "department": "INLS",
    "number": "561",
    "gen eds": "",
    "requirements": "",
    "description": "Digital Forensics for Curation of Digital Collections. 3 Credits.   Students will learn about hardware, software, principles, and methods for capturing and curating digital data that have been stored on removable media (i.e., hard drives, floppy disks, USB memory sticks).   "
  },
  {
    "department": "INLS",
    "number": "566",
    "gen eds": "",
    "requirements": "Prerequisite, INLS 161 or 461.   ",
    "description": "Information Assurance. 3 Credits.   Aspects of data integrity, privacy, and security from several perspectives: legal issues, technical tools and methods, social and ethical concerns, and standards.   "
  },
  {
    "department": "INLS",
    "number": "572",
    "gen eds": "",
    "requirements": "Prerequisite, INLS 161.   ",
    "description": "Web Development I. 1.5 Credit.   Introduction to Internet history, architecture, and applications. Introduces design principles for creating usable and accessible Web sites. Develops technical skills and understanding of standards.   "
  },
  {
    "department": "INLS",
    "number": "573",
    "gen eds": "",
    "requirements": "Prerequisite, INLS 161.   ",
    "description": "Mobile Web Development. 1.5 Credit.   An introduction to techniques and technologies for the development of mobile Web sites and their applications.   "
  },
  {
    "department": "INLS",
    "number": "576",
    "gen eds": "",
    "requirements": "Prerequisite, INLS 161 or 461.   ",
    "description": "Distributed Systems and Administration. 3 Credits.   Distributed and client/server-based computing. Includes operating system basics, security concerns, and issues and trends in network administration.   "
  },
  {
    "department": "INLS",
    "number": "578",
    "gen eds": "",
    "requirements": "Prerequisite, INLS 161 or 461.   ",
    "description": "Protocols and Network Management. 3 Credits.   Network protocols and protocol stacks. Included are discussions of protocol classes, packet filtering, address filtering, network management, and hardware such as protocol analyzers, repeaters, routers, and bridges.   "
  },
  {
    "department": "INLS",
    "number": "581",
    "gen eds": "",
    "requirements": "",
    "description": "Research Methods Overview. 3 Credits.   An introduction to research methods used in information and library science, exploring the design, interpretation, analysis, and application of published research.   "
  },
  {
    "department": "INLS",
    "number": "582",
    "gen eds": "",
    "requirements": "",
    "description": "Systems Analysis. 3 Credits.   Introduction to the systems approach to the design and development of information systems. Methods and tools for the analysis and modeling of system functionality (e.g., structured analysis) and data represented in the system (e.g., object-oriented analysis) are studied. Undergraduates are encouraged to take INLS 382 instead of this course. Students may not receive credit for both INLS 582 and INLS 382.   "
  },
  {
    "department": "INLS",
    "number": "584",
    "gen eds": "",
    "requirements": "",
    "description": "Information Ethics. 3 Credits.   An overview of ethical reasoning, followed by discussion of issues most salient to information professionals, e.g., intellectual property, privacy, access/censorship, effects of computerization, and ethical codes of conduct.   "
  },
  {
    "department": "INLS",
    "number": "585",
    "gen eds": "",
    "requirements": "",
    "description": "Management for Information Professionals. 3 Credits.   Introduction to management principles and practices for information professionals working in all types of organizations. Topics include planning, budgeting, organizational theory, staffing, leadership, organizational change and evaluation, and decision making.   "
  },
  {
    "department": "INLS",
    "number": "586",
    "gen eds": "",
    "requirements": "",
    "description": "Project Management. 1.5 Credit.   Strategies and skills needed to effectively manage projects, integrating project management theory with best practices in different organizational perspectives. Individual and team assignments include readings and case studies.   "
  },
  {
    "department": "INLS",
    "number": "609",
    "gen eds": "",
    "requirements": "Prerequisite, INLS 509.   ",
    "description": "Experimental Information Retrieval. 3 Credits.   This course takes an in-depth look at experimental information retrieval systems that focus on different search tasks and are evaluated in community-wide evaluation forums such as TREC and INEX.   "
  },
  {
    "department": "INLS",
    "number": "613",
    "gen eds": "",
    "requirements": "",
    "description": "Text Mining. 3 Credits.   This course will allow the student to develop a general understanding of knowledge discovery and gain a specific understanding of text mining. Students will become familiar with both the theoretical and practical aspects of text mining and develop a proficiency with data modeling text.   "
  },
  {
    "department": "INLS",
    "number": "620",
    "gen eds": "",
    "requirements": "Prerequisites, INLS 520 or 560.   ",
    "description": "Web Information Organization. 3 Credits.   Similar programming background needed. Understand the Web as a platform for information organizing systems. Learn how the Web has been designed to be a service platform, data publishing platform, and application platform.   "
  },
  {
    "department": "INLS",
    "number": "621",
    "gen eds": "",
    "requirements": "",
    "description": "Personal Information Management. 3 Credits.   This course focuses on issues in personal information management research and practice, including information organization, human cognition and memory, task continuity across devices, preservation, and the role of technology in personal information management.   "
  },
  {
    "department": "INLS",
    "number": "623",
    "gen eds": "",
    "requirements": "Prerequisites, INLS 382 or 582, and 523.   ",
    "description": "Database Systems II: Intermediate Databases. 3 Credits.   Intermediate-level design and implementation of database systems, building on topics studied in INLS 523. Additional topics include MySQL, indexing, XML, and nontext databases.   "
  },
  {
    "department": "INLS",
    "number": "624",
    "gen eds": "",
    "requirements": "Prerequisite, INLS 461 or COMP 110 or 116.   ",
    "description": "Policy-Based Data Management. 3 Credits.   Students will develop policies for managing digital repositories and persistent archives. The rules will be implemented in the integrated Rule-Oriented Data System (iRODS), which organizes and distributes data into shareable collections.   "
  },
  {
    "department": "INLS",
    "number": "625",
    "gen eds": "",
    "requirements": "Prerequisite, INLS 560; permission of the instructor for students lacking the prerequisite.   ",
    "description": "Information Analytics. 3 Credits.   This course introduces analytical techniques to deal with very large data sets. Students will become familiar with predictive modeling, clustering, data mining, and paradigms such as map resource.   "
  },
  {
    "department": "INLS",
    "number": "626",
    "gen eds": "",
    "requirements": "Prerequisite, INLS 523.   ",
    "description": "Introduction to Big Data and NoSQL. 1.5 Credit.   Information is being generated at an exponential scale in many areas, from astronomy to social networking and e-marketing. Processes for handling these data are data intensive, require heavy read/write workloads, and do not need the stringent ACID properties of relational databases. Several specific systems will be studied as examples.   "
  },
  {
    "department": "INLS",
    "number": "641",
    "gen eds": "",
    "requirements": "",
    "description": "Visual Analytics. 3 Credits.   This project-based course provides an overview of visual analytics. Material includes foundational concepts and theories, seminal and recent research in the field, and hands-on experience with commonly used technologies. Programming experience strongly recommended.   "
  },
  {
    "department": "INLS",
    "number": "651",
    "gen eds": "",
    "requirements": "",
    "description": "Audio-Visual Archives Management. 1.5 Credit.   An introduction to the management of audio, film, and video archives with an emphasis on the history of recording, best practices for preservation and access, and copyright. Through selected readings, lecture, class discussion, assignment, and hands-on demonstration, students will gain an understanding of the history of recording, format identification, storage and handling, philosophy of media preservation, and copyright.   "
  },
  {
    "department": "INLS",
    "number": "660",
    "gen eds": "",
    "requirements": "",
    "description": "Social Media and Society: A Theoretical and Empirical Overview. 3 Credits.   Explores the evolution, implications, and complications of social media in multiple spheres of life including sociality, community, politics, power and inequality, education, and information from theoretical and empirical perspectives.   "
  },
  {
    "department": "INLS",
    "number": "672",
    "gen eds": "",
    "requirements": "Prerequisite, INLS 572.   ",
    "description": "Web Development II. 3 Credits.   Study of design and implementation of applications using both client and server side configuration and programming. Example topics include PHP, ruby on Rails, and Javascript.   "
  },
  {
    "department": "INLS",
    "number": "690",
    "gen eds": "",
    "requirements": "",
    "description": "Intermediate Selected Topics. 1-3 Credits.   Exploration of a special topic not otherwise covered in the curriculum, at an intermediate level. Previous offering of this course does not predict future availability; new courses may replace these. Topic varies by instructor.   Repeat rules: May be repeated for credit; may be repeated in the same term for different topics; 9 total credits. 3 total completions.   "
  },
  {
    "department": "INLS",
    "number": "691H",
    "gen eds": "CI, EE-Mentored Research.   ",
    "requirements": "",
    "description": " Research Methods in Information Science. 3 Credits.   Senior standing and permission of the instructor. Restricted to information science majors. An introduction to research methods used in information science. Includes the writing of a research proposal.   "
  },
  {
    "department": "INLS",
    "number": "692H",
    "gen eds": "EE-Mentored Research.   ",
    "requirements": "",
    "description": " Honors Thesis in Information Science. 3 Credits.   Senior standing and permission of the instructor. Restricted to information science majors Students in the SILS undergraduate honors program engage in independent research and write an honors thesis reporting the research under the supervision of a faculty member.   "
  },
  {
    "department": "INLS",
    "number": "696",
    "gen eds": "",
    "requirements": "Prerequisite, permission of the instructor.   ",
    "description": "Study in Information and Library Science. 1-3 Credits.   Study by an individual student on a special topic under the direction of a specific faculty member. Six credit maximum for master's students. Graduate faculty.   Repeat rules: May be repeated for credit; may be repeated in the same term for different topics; 6 total credits. 2 total completions.   "
  },
  {
    "department": "INLS",
    "number": "697",
    "gen eds": "",
    "requirements": "",
    "description": "Information Science Capstone. 3 Credits.   Senior standing required. Information science major or minor. Contemporary topics of information science, information systems, information technology, information design, and information management. Assessment of future impact of new developments.   "
  }
]