[
  {
    "department": "MEJO",
    "number": "89. ",
    "gen eds": "",
    "requirements": "",
    "description": "irst-Year Seminar: Special Topics. 3 Credits. Special topics course. Contents will vary each semester. Repeat rules: May be repeated for credit; may be repeated in the same term for different topics; 6 total credits. 2 total completions. Grading status: Letter grade. "
  },
  {
    "department": "MEJO",
    "number": "100",
    "gen eds": "",
    "requirements": "",
    "description": "Grammar for Journalists. 1 Credit. The goal of this course is to teach students basic skills in grammar, punctuation, and spelling and help prepare them for the school's spelling and grammar exam. Students must earn a score of 70 or above on the exam to receive their degree. Grading status: Letter grade. "
  },
  {
    "department": "MEJO",
    "number": "101",
    "gen eds": "",
    "requirements": "",
    "description": "The Media Revolution: From Gutenberg to Zuckerberg and Beyond. 3 Credits. An introduction to the various facets of communication from the objective world of news media to the persuasive worlds of advertising, public relations, and social media. Developing skills and strengthening knowledge concerning media and communication industries, their content, and their effects on society as well as on individuals. Gen Ed: SS. Grading status: Letter grade. "
  },
  {
    "department": "MEJO",
    "number": "102",
    "gen eds": "",
    "requirements": "",
    "description": "Future Vision: Exploring the Visual World. 3 Credits. Survey of visual communication tools, techniques, and theories, and how they may be used in all areas of the mass media, present and future. Not open to students who have already taken MEJO 180, 182, or 187. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "121",
    "gen eds": "",
    "requirements": "",
    "description": "Introduction to Digital Storytelling. 3 Credits. Restricted to declared journalism majors and minors. Introduces students to the tools and skills needed to engage in quality news-oriented storytelling with audio, video, and multimedia. Students will learn to deliver news stories using multiple platforms, taking advantage of the strengths of each. Previously offered as MEJO 221. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "129",
    "gen eds": "",
    "requirements": "",
    "description": "Sports Xtra. 3 Credits. In this course students will produce a weekly sports highlights, analysis, and commentary program for distribution via cable television. Students fill all editorial, field production, and studio production positions. Previously offered as MEJO 429. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "137",
    "gen eds": "",
    "requirements": "",
    "description": "Principles of Advertising and Public Relations. 3 Credits. Survey of the economics, philosophy, and history of both fields with emphasis on research, foundations, design, execution, and assessment of strategic communication efforts. Provides an understanding of both disciplines, including historical developments, issues and controversies, best practices, career opportunities, and components of successful advertising and public relations campaigns. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "141",
    "gen eds": "",
    "requirements": "",
    "description": "Media Ethics. 3 Credits. Explore what constitutes ethical practices, what interferes with ethical practices, and what emerging ethical issues may challenge the newest generation of professional communicators. Cases involve print, broadcast, and Internet news media; photojournalism; graphic design; public relations; and advertising. Gen Ed: PH. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "153",
    "gen eds": "",
    "requirements": "",
    "description": "Writing and Reporting. 3 Credits. A laboratory course that teaches journalistic skills essential to writing across platforms. Practice in using news gathering tools, such as sourcing and interviewing techniques; writing stories, including leads, organization, quotations, and data; editing for grammar, punctuation, brevity, style, and accuracy; and critical thinking about news values and audiences. Gen Ed: CI. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "157",
    "gen eds": "",
    "requirements": "",
    "description": "News Editing. 3 Credits. Study and practice in copyediting, headline writing, and caption writing for print, digital, and social media. Requisites: Prerequisite, MEJO 153. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "180",
    "gen eds": "",
    "requirements": "",
    "description": "Foundations of Photojournalism. 3 Credits. An introductory course in photojournalistic technique and content gathering. Students photograph, edit, and publish assignments, including general news events, sports, feature and portrait assignments, and a picture story. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "182",
    "gen eds": "",
    "requirements": "",
    "description": "Foundations of Graphic Design. 3 Credits. Principles and practices of design, typography, graphics, and production for visual communication for print and electronic media. Computer graphics and pagination. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "187",
    "gen eds": "",
    "requirements": "",
    "description": "Foundations of Interactive Media. 3 Credits. Entry-level course in multimedia storytelling that includes modules on theory; the profession; design; content gathering; and editing, programming, publishing, and usability. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "240",
    "gen eds": "",
    "requirements": "",
    "description": "Current Issues in Mass Communication. 3 Credits. Analysis of the interrelationships between United States mass media and the society that they serve. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "242",
    "gen eds": "",
    "requirements": "",
    "description": "From Gutenberg to Google: A History of Media. 3 Credits. A historical examination of the changing role of the media professional and forms of media and communication as they have developed in relation to particular social, political, economic, and technological conditions. Gen Ed: HS. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "244",
    "gen eds": "",
    "requirements": "",
    "description": "Talk Politics: An Introduction to Political Communication. 3 Credits. An overview of political communication issues and an examination of political campaigns for students who intend to practice communication in the public arena and for those interested in political processes. Requisites: Prerequisite, MEJO 153. Gen Ed: SS. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "245",
    "gen eds": "",
    "requirements": "",
    "description": "Sports and the Media. 1 Credit. A comprehensive overview of the relationship between sports and the media. Athletes, coaches, and professionals share what goes into producing the sports journalism that we read, listen to, and watch. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "252",
    "gen eds": "",
    "requirements": "",
    "description": "Audio Journalism. 3 Credits. Students learn how to conceive, research, report, and produce audio stories for broadcast on radio and/or streaming on the Web. Students also learn interviewing and reporting techniques that will prepare them for higher-level courses. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "253",
    "gen eds": "",
    "requirements": "",
    "description": "Introduction to Public Affairs Reporting. 3 Credits. Exercises in news gathering, interviewing, and writing news regardless of the delivery platform. Requisites: Prerequisite, MEJO 153. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "332",
    "gen eds": "",
    "requirements": "",
    "description": "Public Relations Writing. 3 Credits. Service-learning course provides hands-on practice in developing multiplatform communication tools (print, digital, and social media) used by public relations practitioners. Previously offered as MEJO 232. Requisites: Prerequisites, MEJO 137 and 153. Gen Ed: EE-Service Learning. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "333",
    "gen eds": "",
    "requirements": "",
    "description": "Video Communication for Public Relations and Marketing. 3 Credits. Introduction to the use of video as a means of communicating with a variety of an organization's publics, both internal and external. Significant emphasis on building professional skills including teamwork, project management, client management, and creative problem solving. Requisites: Prerequisite, MEJO 137. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "334",
    "gen eds": "",
    "requirements": "",
    "description": "Presentation Design for Strategic Communication. 3 Credits. Students learn basic principles of graphic design vocabulary and work with related software. By the end of the course, students should be able to accomplish basic design tasks, understand how software applications work together, and be able to use software as a comfortable part of the creative design process. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "340",
    "gen eds": "",
    "requirements": "",
    "description": "Introduction to Media Law: Journalism Focus. 3 Credits. Focuses on speech and press freedoms under the First Amendment. Topics include prior restraint, libel, privacy, protection of anonymous sources, free press-fair trial, federal regulation of electronic and new media, freedom of information, intellectual property, and international issues. Requisites: Prerequisite, MEJO 153. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "341",
    "gen eds": "",
    "requirements": "",
    "description": "Introduction to Media Law: Advertising, Public Relations, and Strategic Communication Focus. 3 Credits. Focuses on speech and related freedoms under the First Amendment. Topics include commercial speech, corporate speech, libel, privacy, regulated commercial communications, federal regulation of electronic and new media, freedom of information, intellectual property, and international issues. Requisites: Prerequisite, MEJO 153. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "342",
    "gen eds": "",
    "requirements": "",
    "description": "The Black Press and United States History. 3 Credits. A chronological survey of the African American press in the United States since 1827. Emphasis is on key people and issues during critical areas in the African American experience. Gen Ed: HS, US. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "349",
    "gen eds": "",
    "requirements": "",
    "description": "Introduction to Internet Issues and Concepts. 3 Credits. Students develop an understanding of social, legal, political, and other issues related to the use of the Internet. Offered online. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "356",
    "gen eds": "",
    "requirements": "",
    "description": "Feature Writing. 3 Credits. Instruction and practice in writing feature articles for newspapers and magazines. Previously offered as MEJO 256. Requisites: Prerequisite, MEJO 153. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "358",
    "gen eds": "",
    "requirements": "",
    "description": "Opinion Writing. 3 Credits. Practice in writing commentary for all forms of mass communication, from journalism to public relations, no matter the delivery format. Previously offered as MEJO 258. Requisites: Prerequisite, MEJO 153. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "371",
    "gen eds": "",
    "requirements": "",
    "description": "Advertising Creative. 3 Credits. Application of findings from social science research; social responsibility of the copywriter and advertiser; preparation of advertisements for the mass media; research in copy testing. Previously offered as MEJO 271. Requisites: Prerequisite, MEJO 137. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "372",
    "gen eds": "",
    "requirements": "",
    "description": "Advertising Media. 3 Credits. The media-planning function in advertising for both buyers and sellers of media; the relationships among media, messages, and audiences; computer analysis. Previously offered as MEJO 272. Requisites: Prerequisite, MEJO 137. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "376",
    "gen eds": "",
    "requirements": "",
    "description": "Sports Marketing and Advertising. 3 Credits. Examines the range of promotional techniques being used in the modern sports industry. Topics include sponsorships, advertising, merchandising, and the effects of commercialization. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "377",
    "gen eds": "",
    "requirements": "",
    "description": "Sports Communication. 3 Credits. Permission of the instructor. Examination of organizations involved in the sports communication field, including publishing, team and league media relations, college sports information offices, broadcasting, and advertising. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "379",
    "gen eds": "",
    "requirements": "",
    "description": "Advertising and Public Relations Research. 3 Credits. Critical understanding and application of quantitative and qualitative methods used in the strategic planning and evaluation of advertising and public relations campaigns. Course previously offered as MEJO 279. Requisites: Prerequisite, MEJO 137. Gen Ed: QI. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "390",
    "gen eds": "",
    "requirements": "",
    "description": "Special Skills in Mass Communication. 1-3 Credits. Courses on various skills in journalism-mass communication with subjects and instructors varying each semester. This course satisfies a skills- or craft-course requirement. Descriptions for each section available on the school's Web site under Course Details. Repeat rules: May be repeated for credit; may be repeated in the same term for different topics; 9 total credits. 3 total completions. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "393",
    "gen eds": "",
    "requirements": "",
    "description": "Mass Communication Practicum. 1 Credit. Restricted to declared journalism majors and minors. Students work with area media and advertising and public relations firms and meet weekly for consultation and evaluation by the faculty advisor. Must be taken Pass/Fail only. Requisites: Prerequisite, MEJO 153; permission of the instructor for students lacking the prerequisite. Gen Ed: EE-Academic Internship. Repeat rules: May be repeated for credit. 3 total credits. 3 total completions. Grading status: Pass/Fail.  "
  },
  {
    "department": "MEJO",
    "number": "421",
    "gen eds": "",
    "requirements": "",
    "description": "Television News Reporting and Producing. 3 Credits. Permission of the instructor. This course covers writing, reporting, and producing television news stories and programs, with emphasis on basic as well as innovative broadcast story forms. Requisites: Prerequisites, MEJO 121 and 252. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "424",
    "gen eds": "",
    "requirements": "",
    "description": "Media Management and Policy. 3 Credits. An introduction to media management, generally, and the supervision and motivation of employees, specifically. The course also delves into policy and legal issues impacting modern media operations. It explores the special skills associated with management of media properties in the context of constant change. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "425",
    "gen eds": "",
    "requirements": "",
    "description": "Voice and Diction. 3 Credits. Designed to help students develop presentation skills and use voices effectively as professional broadcast journalists. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "426",
    "gen eds": "",
    "requirements": "",
    "description": "Producing Radio. 3 Credits. Students work under faculty guidance to produce \"Carolina Connection,\" a weekly 30-minute radio news program, and are responsible for all production tasks: producing, reporting, anchoring, and editing. Requisites: Prerequisite, MEJO 252. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "435",
    "gen eds": "",
    "requirements": "",
    "description": "Public Information Strategies. 3 Credits. This course provides a comprehensive assessment and understanding of the role of public relations professionals throughout government and the nonprofit sector as well. The course examines the unique requirements placed on communicators who are simultaneously responsible for representing their respective organizations while keeping the public informed. Requisites: Prerequisite, MEJO 137. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "440",
    "gen eds": "",
    "requirements": "",
    "description": "Digital Media Law and Society. 3 Credits. Explains legal issues raised by Internet communication and guides students in thinking critically about how those issues can be resolved. Reviews how courts, other branches of government, the private sector, and legal scholars have responded to the Internet. Topics may include digital copyright, net neutrality, privacy, and Internet censorship abroad. Requisites: Prerequisite, MEJO 340. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "441",
    "gen eds": "",
    "requirements": "",
    "description": "Diversity and Communication. 3 Credits. An examination of racial stereotypes and minority portrayals in United States culture and communication. Emphasis is on the portrayal of Native Americans, African Americans, Hispanics, and Asian Americans in the mass media. Gen Ed: US. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "442",
    "gen eds": "",
    "requirements": "",
    "description": "Gender, Class, Race, and Mass Media. 3 Credits. The media play a critical role in the construction and contestation of ideas about gender, class, and race. Using a range of methods, students will analyze media messages past and present to understand how gender, race, and class influence media production and consumption. Gen Ed: SS, US. Grading status: Letter grade Same as: WGST 442.  "
  },
  {
    "department": "MEJO",
    "number": "443",
    "gen eds": "",
    "requirements": "",
    "description": "Latino Media Studies. 3 Credits. An introductory course to the study of United States Latina/os and the media. It analyzes the media portrayal of Latina/os in United States mainstream media. The course also examines media that cater to Latina/os and explores the way in which Latina/o audiences use the multiple media offerings available to them. Gen Ed: US. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "445",
    "gen eds": "",
    "requirements": "",
    "description": "Process and Effects of Mass Communication. 3 Credits. Mass communication as a social process, incorporating literature from journalism, social psychology, sociology, political science, and history. To acquaint students with factors in message construction, dissemination, and reception by audiences. Gen Ed: SS. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "446",
    "gen eds": "",
    "requirements": "",
    "description": "Global Communication and Comparative Journalism. 3 Credits. Covers theories explaining the workings of global and local communication systems, the transnational flow of news, and opportunities and challenges that social media and other new platforms pose to the production and distribution of news. It also familiarizes students with the media communication systems of key countries. Gen Ed: GL. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "447",
    "gen eds": "",
    "requirements": "",
    "description": "International Media Studies. 3 Credits. The study of media system operations in a particular country including how news and information are disseminated and used by audiences. Includes a trip to the country as part of the course. Requisites: Prerequisite, MEJO 137 or 153. Gen Ed: EE-Field Work, GL. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "448",
    "gen eds": "",
    "requirements": "",
    "description": "Freedom of Expression in the United States. 3 Credits. An examination of the development of freedom of expression in the United States within the context of the nation's history. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "449",
    "gen eds": "",
    "requirements": "",
    "description": "Blogging, Smart Mobs, and We the Media. 3 Credits. For advanced undergraduates through Ph.D. students. Practical and theoretical approaches to understanding, designing, building, and using virtual communities, including studies of network capital, social capital, and social production. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "454",
    "gen eds": "",
    "requirements": "",
    "description": "Advanced Feature Writing. 3 Credits. Writing and reporting important topics in in-depth feature articles. Discussion and utilization of writing and reporting techniques in order to complete articles for publication or other dissemination. In-depth instruction and critiques of student work. Requisites: Prerequisites, MEJO 153 and 256. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "455",
    "gen eds": "",
    "requirements": "",
    "description": "Creative Sportswriting. 3 Credits. Researching and writing sports stories, including game coverage, magazine features, and opinion columns. Students complete reporting and writing exercises inside and outside of the classroom. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "458",
    "gen eds": "",
    "requirements": "",
    "description": "Southern Politics: Critical Thinking and Writing. 3 Credits. Interpretive-contextual journalism focused on the trends, issues, and politics that influence democracy in North Carolina, the American South, and the nation. Through readings and the practice of analytical journalism, the course explores government policy making, election campaigns, social and economic trends, ethics, and citizen-leader relationships. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "459",
    "gen eds": "",
    "requirements": "",
    "description": "Community Journalism. 3 Credits. Comprehensive study of the community press, including policies, procedures, and issues surrounding the production of smaller newspapers within the context of the community in its social and civic setting. Requisites: Prerequisite, MEJO 153. Gen Ed: EE-Service Learning, US. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "463",
    "gen eds": "",
    "requirements": "",
    "description": "News Lab: Creating Tomorrow's News Products. 3 Credits. Students work under faculty guidance to develop and test an idea for a start-up news product. Students will create a prototype, test it on a target market, and compile a business feasibility report for the product. The course emphasizes collaboration among students with a variety of skills and experiences. Gen Ed: EE-Field Work. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "469",
    "gen eds": "",
    "requirements": "",
    "description": "Health Communication. 3 Credits. This course covers theory and research underlying effective health communication campaigns. Students will learn about both the development and evaluation of real-world health campaigns. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "471",
    "gen eds": "",
    "requirements": "",
    "description": "Advanced Advertising Copywriting. 3 Credits. Rigorous, in-depth instruction and critiques of student advertising writing. Requisites: Prerequisites, MEJO 271 and permission of the instructor. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "475",
    "gen eds": "",
    "requirements": "",
    "description": "Concepts of Marketing. 3 Credits. Designed to provide the larger business context for students anticipating careers in advertising, public relations, and other media industries, the course teaches the vocabulary and basic concepts of marketing as it will be practiced. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "476",
    "gen eds": "",
    "requirements": "",
    "description": "Ethical Issues and Sports Communication. 3 Credits. Permission of the instructor. Ethical dilemmas and decisions in the commercialization and coverage of sports, including the influence of television, pressure to change traditions and standards for monetary reasons, and negative influences on athletes. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "477",
    "gen eds": "",
    "requirements": "",
    "description": "New Media Technologies: Their Impact on the Future of Advertising, Marketing, and Public Relations. 3 Credits. This course will introduce you to the nontraditional, future vision required to be successful in advertising, marketing, and public relations and the more personal, individualized technologies that will grab people's attention in the future. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "478",
    "gen eds": "",
    "requirements": "",
    "description": "Media Marketing. 3 Credits. Principles and practices of retail advertising in all media, with emphasis on selling, writing, and layout of retail advertising for the print media. Requisites: Prerequisite, MEJO 137. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "479",
    "gen eds": "",
    "requirements": "",
    "description": "Market Intelligence. 3 Credits. Permission of the instructor. This course helps students learn to make better business decisions by teaching contemporary analytical tools to solve brand and advertising problems. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "482",
    "gen eds": "",
    "requirements": "",
    "description": "Media Design. 3 Credits. Permission of the instructor. Detailed study of page layout and graphics techniques for all forms of news media. Requisites: Prerequisite, MEJO 182; pre- or co-requisite, MEJO 153. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "484",
    "gen eds": "",
    "requirements": "",
    "description": "Information Graphics. 3 Credits. Study and application of graphic design and information-gathering techniques to creating charts, maps, and diagrams. Requisites: Prerequisite, MEJO 182; permission of the instructor for students lacking the prerequisite. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "485",
    "gen eds": "",
    "requirements": "",
    "description": "Publication Design. 3 Credits. Detailed study and application of graphic design techniques in magazines, newspapers, advertising, and corporate communication. Requisites: Prerequisite, MEJO 182; pre- or co-requisite, MEJO 153; permission of the instructor. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "487",
    "gen eds": "",
    "requirements": "",
    "description": "Intermediate Interactive Media. 3 Credits. Web programming, graphic design, and storytelling for the Web. Students will use HTML5 CSS3, JavaScript, and other Web publishing languages while learning how to design, storyboard, and script an interactive storytelling project. Students will collect and incorporate photos, text, video, graphics, and database information into interactive multimedia presentations. Previously offered as MEJO 586. Requisites: Prerequisite, MEJO 187. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "488",
    "gen eds": "",
    "requirements": "",
    "description": "Multimedia Storytelling: Carolina Photojournalism Workshop. 3 Credits. The Carolina Photojournalism Workshop has a dual mission: to provide an immersive, real-world learning experience for students, and to create and publish exceptional multimedia content on the culture of North Carolina that can be a resource for people in our state and the world. Previously offered as MEJO 587. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "489",
    "gen eds": "",
    "requirements": "",
    "description": "Photojournalism, Lighting, and Business Techniques. 3 Credits. Students expand their personal photographic vision and professional portfolio by honing their knowledge and skills of studio and location lighting, propping, and styling. Students learn studio and location portraiture and photo illustration and create a photo essay or portrait series. Previously offered as MEJO 181. Requisites: Prerequisite, MEJO 180. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "490",
    "gen eds": "",
    "requirements": "",
    "description": "Special Topics in Mass Communication. 1-3 Credits. Small classes on various aspects of journalism-mass communication with subjects and instructors varying each semester. Descriptions for each section available on the school's Web site under Course Details. Honors version available Repeat rules: May be repeated for credit; may be repeated in the same term for different topics; 9 total credits. 3 total completions. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "522",
    "gen eds": "",
    "requirements": "",
    "description": "Producing Television News. 3 Credits. Permission of the instructor. Students work under faculty guidance to produce \"Carolina Week,\" a television news program, and are responsible for all production tasks such as producing, reporting, anchoring, directing, and others. Previously offered as MEJO 422. Requisites: Prerequisite, MEJO 421. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "523",
    "gen eds": "",
    "requirements": "",
    "description": "Broadcast News and Production Management. 3 Credits. Permission of the instructor. Students participate in a collaborative learning environment to hone skills learned in earlier courses and help less-experienced students acclimate to the broadcast news experience within the school. By invitation only. Previously offered as MEJO 423. Requisites: Prerequisite, MEJO 129 or 426 or 522. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "531",
    "gen eds": "",
    "requirements": "",
    "description": "Case Studies in Public Relations. 3 Credits. Helps students think as public relations professionals who deal with the demanding, dynamic environment of corporate, government, and nonprofit public relations. Students examine real-world situations and strategies, discussing factors that affect how public relations is practiced in organizations, including identifying stakeholder groups, developing strategies, embracing diversity, and recognizing ethical issues. Previously offered as MEJO 431. Requisites: Prerequisite, MEJO 137. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "533",
    "gen eds": "",
    "requirements": "",
    "description": "Crisis Communication. 3 Credits. Provides an assessment and understanding of crises, examining the role public relations professionals play in helping organizations use mass communication theories and best practices. Includes media training. Introduces students to areas of crisis research, allowing them to complete the Federal Emergency Management Agency's National Incident Management System certification. Previously offered as MEJO 433. Requisites: Prerequisites, MEJO 137 and 153. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "541",
    "gen eds": "",
    "requirements": "",
    "description": "Economics Reporting. 3 Credits. Permission of the instructor. Coverage of Wall Street and the economy, including stocks, bonds, and economic indicators. Reporting on the Federal Reserve, labor, consumer sector, manufacturing and inflation, and certain industries. Previously offered as MEJO 451. Requisites: Prerequisite, MEJO 153. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "542",
    "gen eds": "",
    "requirements": "",
    "description": "Business Reporting. 3 Credits. Methods and tactics of covering businesses for mass communication. Why and how companies operate and how to write stories about corporate news from public records and other sources. Previously offered as MEJO 452. Requisites: Prerequisite, MEJO 153. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "550",
    "gen eds": "",
    "requirements": "",
    "description": "Business and the Media. 3 Credits. Role of media in United States society and effects on public perceptions of business. Relationship of business press and corporate America. Current issues in business journalism. Previously offered as MEJO 450. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "551",
    "gen eds": "",
    "requirements": "",
    "description": "Digital Media Economics and Behavior. 3 Credits. The course will focus on the changing economics affecting 21st-century news organizations and the economic drivers of other content providers such as music companies, the film industry, online aggregators, and commerce sites for lessons that can be applied across industry segments. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "552",
    "gen eds": "",
    "requirements": "",
    "description": "Leadership in a Time of Change. 3 Credits. During a time of fast-paced technological innovation, this course examines the critical strategic choices facing media executives. Students will observe and research a media company that is making the transition, as well as produce a case study on that effort. Requisites: Prerequisite, MEJO 452, 475 or 551. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "553",
    "gen eds": "",
    "requirements": "",
    "description": "Advanced Reporting. 3 Credits. Rigorous, in-depth instruction and critiques of students' news and feature assignments done with different reporting methodologies: interviewing, official records, direct and participant observation, and survey research (the Carolina Poll). Previously offered as MEJO 453. Requisites: Prerequisites, MEJO 153 and 253. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "557",
    "gen eds": "",
    "requirements": "",
    "description": "Advanced Editing. 3 Credits. Concentration on the editing and display of complex news and features stories and other print media content with a significant emphasis on newspaper design and graphics. Previously offered as MEJO 457. Requisites: Prerequisite, MEJO 157. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "560",
    "gen eds": "",
    "requirements": "",
    "description": "Environmental and Science Journalism. 3 Credits. Prepare students to work as environmental and science journalists. The course emphasizes writing skills in all delivery formats and interpreting environmental, science, and medical information for consumers. Grading status: Letter grade Same as: HBEH 660, HPM 550.  "
  },
  {
    "department": "MEJO",
    "number": "561",
    "gen eds": "",
    "requirements": "",
    "description": "Environmental and Science Video Storytelling. 3 Credits. Students work in teams to produce, shoot, script, and report environmental, science, and medical stories for broadcast on \"Carolina Week\", the award-winning, student-produced television newscast. Grading status: Letter grade Same as: HBEH 561, HPM 551.  "
  },
  {
    "department": "MEJO",
    "number": "562",
    "gen eds": "",
    "requirements": "",
    "description": "Environmental and Science Documentary Television. 3 Credits. Students work in teams to conceive, produce, and script mini-documenties on environmental and science topics for broadcast on North Carolina Public Television. Grading status: Letter grade Same as: HBEH 562, HPM 552.  "
  },
  {
    "department": "MEJO",
    "number": "564",
    "gen eds": "",
    "requirements": "",
    "description": "Medical and Science Reporting. 3 Credits. Required preparation, a second reporting or writing course. Focuses on developing strategies to research and write about medical issues, specifically selecting topics, finding and evaluating sources, and information gathering. Students produce a range of stories, from short consumer pieces to in-depth articles. Requisites: Prerequisite, MEJO 153. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "565",
    "gen eds": "",
    "requirements": "",
    "description": "Environmental Storytelling. 3 Credits. An interdisciplinary course for students interested in environmental issues or journalism to produce stories about environmental issues that matter to North Carolinians. Students learn to identify credible sources, manage substantial amounts of information, and find story focus as they report on technical and often controversial subjects in a variety of media. Grading status: Letter grade Same as: ENEC 565.  "
  },
  {
    "department": "MEJO",
    "number": "570",
    "gen eds": "",
    "requirements": "",
    "description": "Data Driven Journalism. 3 Credits. An introduction to basic statistics and numerical and mathematical literacy, as well as a look at professional data-driven journalism projects. Students who successfully complete this course will be able to acquire, organize, analyze, and present data to a general news audience. Previously offered as MEJO 460. Gen Ed: QI. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "572",
    "gen eds": "",
    "requirements": "",
    "description": "Art Direction in Advertising. 3 Credits. This course provide students with finished advertising for their portfolios through visual theory instruction, creative exercises, and strategy application. Previously offered as MEJO 472. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "577",
    "gen eds": "",
    "requirements": "",
    "description": "The Branding of Me. 3 Credits. What have you done to brand yourself? Students will use YouTube, Twitter, and Facebook in a calculated plan with other new-media marketing tools to land that first job. Previously offered as MEJO 474. Requisites: Prerequisite, MEJO 477. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "580",
    "gen eds": "",
    "requirements": "",
    "description": "Photo Stories. 3 Credits. Advanced course in photojournalism content gathering, history, ethics and storytelling. Students shoot advanced newspaper and magazine assignments and create short multimedia stories combining photography, audio, and video. Previously offered as MEJO 480. Requisites: Prerequisite, MEJO 180; pre- or co-requisite, MEJO 153; Permission of the instructor. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "581",
    "gen eds": "",
    "requirements": "",
    "description": "Multimedia Design. 3 Credits. Theory and practice of multimedia design with an emphasis on usability, design theory, and evaluative methodologies, including focus groups, survey research, eye-track testing, and search engine optimization. Requisites: Prerequisite, MEJO 187; permission of the instructor for students lacking the prerequisite. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "582",
    "gen eds": "",
    "requirements": "",
    "description": "Advanced Documentary Video Storytelling. 3 Credits. Permission of the instructor. Students learn how to gather audio and video content, editing and storytelling techniques, and how to publish these media onto a variety of multimedia platforms. Requisites: Prerequisites, MEJO 121, and 180 or 187. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "583",
    "gen eds": "",
    "requirements": "",
    "description": "Advanced Interactive Media. 3 Credits. Permission of the instructor. Advanced course in multimedia programming languages that includes designing and building dynamic projects. Requisites: Prerequisite, MEJO 187. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "584",
    "gen eds": "",
    "requirements": "",
    "description": "International Projects. 3 Credits. Permission of the instructor. Students work on a semester-long documentary multimedia project in an international location that includes photo and video journalists, audio recordists, designers, infographics artists, and programmers. Open by application to students who have completed an advanced course in visual or electronic communication. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "585",
    "gen eds": "",
    "requirements": "",
    "description": "3D Design Studio. 3 Credits. Permission of the instructor. The use of 3D design and animation to create visual explanations. Requisites: Prerequisites, MEJO 187 and 182. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "588",
    "gen eds": "",
    "requirements": "",
    "description": "Emerging Technologies. 3 Credits. This class will teach students how to think about mobile media products. Students will learn to solve problems, design mobile user experiences, write the hybrid code to make it work, and then deploy, test, and make it better. The class will be a mix of design and product development theories. Previously offered as MEJO 660. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "589",
    "gen eds": "",
    "requirements": "",
    "description": "Motion Graphics. 3 Credits. Permission of the instructor. Detailed study and application of motion-graphic techniques that utilize the combination of words, photos, graphics, video, sound, and voice-overs to convey stories for news and entertainment. Students learn Adobe After Effects software and the art of storytelling to enable them to conceptualize and execute digital animations. Previously offered as MEJO 486. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "596",
    "gen eds": "",
    "requirements": "",
    "description": "Individual Study. 3 Credits. Permission of the instructor. An individual readings and problems course to be directed by a faculty member in whose field of interest the subject matter lies. Repeat rules: May be repeated for credit; may be repeated in the same term for different topics; 6 total credits. 2 total completions. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "602",
    "gen eds": "",
    "requirements": "",
    "description": "Mass Communication Education in the Secondary School. 3 Credits. Graduate standing. Readings, discussion, and projects fostering excellence in teaching journalism-mass communication in the high school, from philosophy and practice to professional skills. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "603",
    "gen eds": "",
    "requirements": "",
    "description": "Mass Communication Law in the Secondary School. 3 Credits. Graduate standing. Application of First Amendment speech and press freedoms to secondary school media, including libel, privacy, access to information, journalistic privilege, prior restraint, advertising and broadcast regulations, and ethical practices. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "604",
    "gen eds": "",
    "requirements": "",
    "description": "Mass Communication Writing and Editing in the Secondary School. 3 Credits. Graduate standing. High school journalism teachers and advisors learn to teach the skills journalists need to communicate. Emphasis on writing and thinking skills necessary to convert information into clear messages. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "605",
    "gen eds": "",
    "requirements": "",
    "description": "Design and Production of Secondary School Publications. 3 Credits. Graduate standing. High school journalism teachers and advisors learn to teach the skills journalists need to produce publications. Designed for persons with no background in design. Degree-seeking students may not use both MEJO 182 and 605 to complete degree requirements. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "625",
    "gen eds": "",
    "requirements": "",
    "description": "Media Hub. 3 Credits. Permission of the department. Students will work together to find, produce, and market stories that would attract the attention of professional media partners throughout the state and region, and at times, the nation. This hands-on course mimics the professional journalist's work environment more than any other class in the school. Gen Ed: EE-Field Work. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "634",
    "gen eds": "",
    "requirements": "",
    "description": "Public Relations Campaigns. 3 Credits. In this capstone experience, students apply concepts and skills from earlier classes to develop a campaign plan for a client organization. Activities include conducting background and audience research; developing realistic objectives, strategies, tactics, and evaluation plans; producing a portfolio of supporting materials; and pitching the campaign to the client. Previously offered as MEJO 434. Requisites: Prerequisites, MEJO 332, 379, and 531. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "650",
    "gen eds": "",
    "requirements": "",
    "description": "Workroom FashionMash Experiential Design. 3 Credits. The course combines a development workshop with a professional industry project, giving students unprecedented access to working creatives, industry trendsetters, and decision makers. In Workroom students will think, write, and execute their creative ideas. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "651",
    "gen eds": "",
    "requirements": "",
    "description": "Workroom FashionMash Product Design. 3 Credits. The course combines a development workshop with a professional industry project, giving you unprecedented access to working creatives, industry trendsetters and decision makers. In Workroom you will not simply think and write about your creative ideas, instead, this class is completely focused on execution. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "656",
    "gen eds": "",
    "requirements": "",
    "description": "Magazine Writing and Editing. 3 Credits. Instruction and practice in planning, writing, and editing copy for magazines. Previously offered as MEJO 456. Requisites: Prerequisites, MEJO 153 and 356. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "670",
    "gen eds": "",
    "requirements": "",
    "description": "Digital Advertising and Marketing. 3 Credits. This course provides the practical knowledge and insights required to establish digital advertising and marketing objectives and strategies, properly select the earned and paid media platforms, and monitor and measure the results of those efforts. Previously offered as MEJO 470. Requisites: Prerequisites, MEJO 379 and 475. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "671",
    "gen eds": "",
    "requirements": "",
    "description": "Social Marketing Campaigns. 3 Credits. Social marketing is the application of marketing concepts and practices to bring about behavior change for a social good. This course is designed as a service-learning course and fulfills the experiential education requirement. Gen Ed: EE-Service Learning. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "673",
    "gen eds": "",
    "requirements": "",
    "description": "Advertising Campaigns. 3 Credits. Planning and executing advertising campaigns; types and methods of advertising research; the economic function of advertising in society. Previously offered as MEJO 473. Requisites: Prerequisite, MEJO 371 or 372. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "681",
    "gen eds": "",
    "requirements": "",
    "description": "Photojournalism Projects. 3 Credits. Permission of the instructor. Students study the documentary tradition and produce stories within the social documentary genre of photojournalism. Students choose a relevant social issue and create a multimedia Web site featuring long-form documentary storytelling. Previously offered as MEJO 481. Requisites: Prerequisite, MEJO 580. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "683",
    "gen eds": "",
    "requirements": "",
    "description": "Magazine Design. 3 Credits. Permission of the instructor. Detailed study of page layout and graphics techniques in magazines. Previously offered as MEJO 483. Requisites: Prerequisite, MEJO 482. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "690",
    "gen eds": "",
    "requirements": "",
    "description": "Special Topics in Advertising. 1-3 Credits. Courses on special topics in advertising with subjects and instructors varying each semester. Repeat rules: May be repeated for credit; may be repeated in the same term for different topics; 9 total credits. 3 total completions. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "691H",
    "gen eds": "",
    "requirements": "",
    "description": " Introductory Honors Course. 3 Credits. Permission of the instructor. Required of all students reading for honors in journalism. Gen Ed: EE-Mentored Research. Grading status: Letter grade.  "
  },
  {
    "department": "MEJO",
    "number": "692H",
    "gen eds": "",
    "requirements": "",
    "description": " Honors Essay. 3 Credits. Permission of the instructor. Required of all students reading for honors in journalism. Gen Ed: EE-Mentored Research. Grading status: Letter grade."
  }
]