[
  {
    "department": "NURS",
    "number": "253",
    "gen eds": "",
    "requirements": "",
    "description": "Individual Development across the Lifespan. 2 Credits. Majors only. This course emphasizes a lifespan approach to theories and perspectives on individual growth and development. Content focuses on physical, cognitive, and socioemotional development, and risk factors from birth to death. "
  },
  {
    "department": "NURS",
    "number": "254",
    "gen eds": "",
    "requirements": "",
    "description": "Discipline of Nursing I. 1 Credit. Majors only. This course introduces the discipline, profession, and practice of nursing through a study of history, values, culture, legal issues, and education. Critical thinking central to nursing practice is introduced. "
  },
  {
    "department": "NURS",
    "number": "261",
    "gen eds": "",
    "requirements": "",
    "description": "Nursing Role in Normal Nutrition. 2 Credits. Majors only. This course involves the nursing application of nutritional concepts to the care of individuals, families, groups, and populations across the life span. "
  },
  {
    "department": "NURS",
    "number": "360",
    "gen eds": "",
    "requirements": "",
    "description": "Concepts, Processes, and Skills for Evidence-Based Nursing. 4 Credits. Majors only. The course introduces fundamentals of nursing practice and integrates the nursing process with emphasis on the application of evidenced-based practice. The role of the nurse as a member of the healthcare team is emphasized. The lab setting provides practical application of principles and skills required for clinical practice. "
  },
  {
    "department": "NURS",
    "number": "361",
    "gen eds": "",
    "requirements": "",
    "description": "Pathophysiology. 3 Credits. Majors only. This course is concerned with alterations involved in disruptions of normal physiology as well as pathophysiological principles underlying therapeutic interventions and outcomes. "
  },
  {
    "department": "NURS",
    "number": "362",
    "gen eds": "",
    "requirements": "",
    "description": "Pharmacology across the Lifespan. 3 Credits. Majors only. Using the science of pharmacology and pharmacologic principles underlying therapeutic interventions, this course focuses on an introduction to nursing responsibilities regarding pharmacologic therapy across the lifespan. "
  },
  {
    "department": "NURS",
    "number": "364",
    "gen eds": "",
    "requirements": "Prerequisites, NURS 253, 261, 361, and 366. Corequisites, NURS 360 and 362. ",
    "description": "Nursing Care of Adults with Major Health Problems, I. 6 Credits. Majors only. This is the first of two adult health courses in which students apply critical thinking skills to nursing care of adults with major health problems. "
  },
  {
    "department": "NURS",
    "number": "366",
    "gen eds": "",
    "requirements": "",
    "description": "Health Assessment. 3 Credits. Majors only. This course addresses concepts and methods of comprehensive health assessment of children, adults, and elders. Emphasis will be on data collection as a basis for initiation of caring and decision making in nursing practice. "
  },
  {
    "department": "NURS",
    "number": "369",
    "gen eds": "",
    "requirements": "",
    "description": "Physical Assessment. 3 Credits. Admission to the RN-BSN option or permission of the instructor. This course expands the student's previous knowledge base of the skills and principles of historical, psychological, and physical assessment and identifies these data as the basis for nursing care. "
  },
  {
    "department": "NURS",
    "number": "371",
    "gen eds": "",
    "requirements": "co-requisite, NURS 364; ",
    "description": "Nursing Inquiry and Evidence-Based Practice. 3 Credits. Pre- or permission of the instructor for students lacking the prerequisite. Students are introduced to key concepts of evidence-based nursing practice, including the research process, protection of human subjects, and retrieval and appraisal of evidence to maintain a scientifically sound practice. "
  },
  {
    "department": "NURS",
    "number": "377",
    "gen eds": "",
    "requirements": "",
    "description": "Research in Nursing Practice. 3 Credits. Majors only. This course introduces components of the research process with application to the theory and practice of nursing. The course provides the foundation for master's-level nursing research course. "
  },
  {
    "department": "NURS",
    "number": "379",
    "gen eds": "",
    "requirements": "",
    "description": "Leadership in Nursing Practice. 3 Credits. Majors only. Students will examine health care organizations from a systems perspective and develop leadership skills necessary in professional practice. "
  },
  {
    "department": "NURS",
    "number": "382",
    "gen eds": "",
    "requirements": "",
    "description": "Family-Centered Genomic Health Care. 1 Credit. Majors only. This course explores essential competencies in genetics and genomics for registered nurses. The learner gains knowledge about family assessment and the impact of genomic issues on individuals and families. "
  },
  {
    "department": "NURS",
    "number": "456",
    "gen eds": "",
    "requirements": "Prerequisites, NURS 254 and at least one of the following: NURS 470, 472, 477, or 479. ",
    "description": "Discipline of Nursing II. 2 Credits. Majors only. This course emphasizes professional development through exploration of a variety of roles and practice environments. Students analyze personal and professional goals and values to develop a framework for nursing practice. Repeat rules: May be repeated for credit. 2 total credits. 1 total completions. "
  },
  {
    "department": "NURS",
    "number": "470",
    "gen eds": "",
    "requirements": "Prerequisites, NURS 364 and 371. Co-requisites, NURS 472, 477, or 479. ",
    "description": "Public Health Nursing. 5 Credits. Majors only. Students apply public health concepts to community practice to improve health and reduce disparities across the lifespan, emphasizing interventions using partnership strategies at individual/family, organizational, and policy levels. "
  },
  {
    "department": "NURS",
    "number": "472",
    "gen eds": "",
    "requirements": "Prerequisite, NURS 364. ",
    "description": "Nursing Care of Infants, Children, and Their Families. 5 Credits. Majors only. Nursing care of infants, children, and their families is explored. Knowledge from a variety of disciplines is applied through the nursing process to the direct care of infants and children. "
  },
  {
    "department": "NURS",
    "number": "477",
    "gen eds": "",
    "requirements": "Prerequisites, NURS 253, 361, and 362. Corequisites, NURS 364 and 382. ",
    "description": "Psychiatric Mental Health Concepts for Broad Clinical Application in Nursing. 5 Credits. Majors only. Using theories of psychosocial development, psychopathology, therapeutic communication, and psychotherapy, this course requires students to examine the range and complexities of human emotional suffering and methods of effective intervention. "
  },
  {
    "department": "NURS",
    "number": "479",
    "gen eds": "",
    "requirements": "Prerequisite, NURS 364. ",
    "description": "Maternal/Newborn Nursing. 5 Credits. Majors only. The course focuses on application of caring and critical thinking skills in providing evidence-based nursing care to childbearing families. "
  },
  {
    "department": "NURS",
    "number": "487",
    "gen eds": "",
    "requirements": "Prerequisites, NURS 254 and 364. ",
    "description": "Practicum in Nursing: Work-Study Experience. 3 Credits. Certification as Nurse Aide I and II also required as pre- or corequisite. Majors only. This course provides the student an opportunity to participate in a work-study experience in participating health care agencies. Students participate in a reflective experience that integrates classroom and experiential learning. "
  },
  {
    "department": "NURS",
    "number": "488",
    "gen eds": "",
    "requirements": "Prerequisites, NURS 254 and 364. ",
    "description": "Practicum in Nursing: Health Services Improvement Work Experience. 3 Credits. Majors only. Certification as a Nurse Aide I and Nurse Aide II are recommended. Practice in health care settings is the course focus. Students participate in a reflective experience that provides the context to integrate classroom and experiential learning into an evolving professional identity. "
  },
  {
    "department": "NURS",
    "number": "489",
    "gen eds": "",
    "requirements": "Prerequisites, NURS 254, 364, and two of the following: NURS 470, 472, 477, 479, 591. ",
    "description": "Practicum in Nursing: Global Health Experience. 3 Credits. Majors only. Certifications as a Nurse Aide I and Nurse Aide II are recommended. Practice in global health care settings is the course focus. Students participate in a reflective experience that provides the context to integrate classroom and experiential learning into an evolving professional identity. "
  },
  {
    "department": "NURS",
    "number": "491",
    "gen eds": "",
    "requirements": "",
    "description": "Improving Nursing Practice: Application of Concepts, Theories, and Research. 3 Credits. Majors only. This course emphasizes analysis of clinical problems that affect the nursing care of selected populations. Students also apply the nursing process, therapeutic communication skills, and teaching-learning principles in clinical situations. "
  },
  {
    "department": "NURS",
    "number": "492",
    "gen eds": "",
    "requirements": "",
    "description": "Conceptual Bases of Professional Nursing Practice. 3 Credits. Majors only. Selected concepts, theories, and models are synthesized, appraised, and applied as a basis for making judgments and decisions in nursing practice. "
  },
  {
    "department": "NURS",
    "number": "494",
    "gen eds": "",
    "requirements": "",
    "description": "Community Health Nursing for the Public's Health. 3-6 Credits. Majors only. Prepares R.N. students for population-focused practice in community health nursing. Analyses and applications of selected theories; health promotion/protection and disease prevention strategies are emphasized. "
  },
  {
    "department": "NURS",
    "number": "496",
    "gen eds": "",
    "requirements": "",
    "description": "Advanced Practicum in Nursing. 1-3 Credits. Majors only. The focus of this course is the development of knowledge and experience related to research or service learning and its application to the practice of nursing and health care. Repeat rules: May be repeated for credit.  "
  },
  {
    "department": "NURS",
    "number": "497",
    "gen eds": "",
    "requirements": "",
    "description": "Preparation for Professional Practice. 1 Credit. Seniors only or permission of the instructor. This course will assist students in preparation for the NCLEX-RN examination through a strategic and systematic individualized plan of study that utilizes the ATI program and other relevant resources. Limited enrollment. Repeat rules: May be repeated for credit. 3 total credits. 3 total completions. "
  },
  {
    "department": "NURS",
    "number": "585",
    "gen eds": "",
    "requirements": "",
    "description": "Alternative Paradigms for Nursing Practice. 3 Credits. Majors only. Concepts and principles underlying biomedical and biopsychosocial approaches to health care delivery are analyzed to determine their impact on health and to provide a framework for integrating both approaches to care. "
  },
  {
    "department": "NURS",
    "number": "586",
    "gen eds": "",
    "requirements": "",
    "description": "Contemporary Issues in Nursing Practice. 3 Credits. Majors only. The context of professional nursing practice will be analyzed from a social, economic, and policy perspective. Analysis will include projections for the future of the profession. "
  },
  {
    "department": "NURS",
    "number": "588",
    "gen eds": "",
    "requirements": "Prerequisites, NURS 364, 371, and 487 or 489, and 472 or 477 or 479. Corequisite, NURS 488. ",
    "description": "Leadership in Health Care Organizations. 4 Credits. Majors only. This course explores organizational leadership and management practices and theories. Current social, economic, legal, ethical, and policy issues affecting practice, education, and the profession of nursing are examined. "
  },
  {
    "department": "NURS",
    "number": "591",
    "gen eds": "EE-Field Work. ",
    "requirements": "Prerequisites, NURS 364 and 371; co-requisite, NURS 456. ",
    "description": "Nursing Care of Adults with Major Health Problems, II. 8 Credits. Majors only. This senior-level course focuses on applying critical thinking, clinical decision making, and evidence-based nursing practice to complex health problems of adults. Unique health needs of older adults are addressed. "
  },
  {
    "department": "NURS",
    "number": "600",
    "gen eds": "",
    "requirements": "",
    "description": "SHAC: Student Health Action Coalition. 0 Credits. This course provides service-learning opportunities to apply nursing practice within the context of interprofessional care for vulnerable populations by participating with Student Health Action Coalition (SHAC) activities. Repeat rules: May be repeated for credit. 0 total credits. 8 total completions. "
  },
  {
    "department": "NURS",
    "number": "609",
    "gen eds": "",
    "requirements": "",
    "description": "Health Care in the Global Context. 1 Credit. Majors only or permission of the instructor. A faculty-led experiential learning opportunity focusing on development and knowledge related to research, health care systems, or service learning and its application to nursing and health care. Repeat rules: May be repeated for credit.  "
  },
  {
    "department": "NURS",
    "number": "611",
    "gen eds": "",
    "requirements": "",
    "description": "Supporting the Childbearing Family. 2 Credits. Application required. An interprofessional, service-learning approach to studying maternity care. Students will receive professional doula training and volunteer as birth doulas within the Volunteer Doula Service Program at North Carolina Women's Hospital. "
  },
  {
    "department": "NURS",
    "number": "642",
    "gen eds": "",
    "requirements": "",
    "description": "Health Promotion and Illness Prevention in Advanced Nursing Practice. 2 Credits. NURS 647. Contemporary Issues in the Role of Advanced Practice Nursing. 3 Credits. Graduate students only. This course examines the evolution, current issues, and roles in advanced practice nursing within the context of contemporary healthcare delivery. "
  },
  {
    "department": "NURS",
    "number": "671",
    "gen eds": "",
    "requirements": "",
    "description": "Nursing Inquiry and Evidence-Based Practice for Advanced Scholarship. 3 Credits. Students anticipating graduate study are introduced to scientific inquiry and principles of evidence-based practice, including theoretical perspectives related to inquiry; ethics; identification of research problems, development of research questions, and appropriate design; data interpretation with emphasis on statistical analysis; and rigorous appraisal of research reports. "
  },
  {
    "department": "NURS",
    "number": "675",
    "gen eds": "",
    "requirements": "",
    "description": "Hillman Scholars in Nursing Innovation: Integrative Seminar. 1 Credit. Admission to the Hillman Scholars Program in Nursing Innovation is required. This seminar will cultivate personal and professional skills essential for students' development and socialization as nurse innovators, leaders, researchers, and scholars. Content is iterative and progressive in depth and scope. Repeat rules: May be repeated for credit.  "
  },
  {
    "department": "NURS",
    "number": "680",
    "gen eds": "",
    "requirements": "",
    "description": "Experimental Courses. 1-3 Credits. Pilot test for new courses in the nursing program. Repeat rules: May be repeated for credit; may be repeated in the same term for different topics; 12 total credits. 4 total completions. "
  },
  {
    "department": "NURS",
    "number": "685",
    "gen eds": "",
    "requirements": "",
    "description": "Care of the Dying and Bereaved throughout the Life Span. 3 Credits. Students from a variety of health sciences-related disciplines gain an understanding of issues in working with dying and bereaved individuals of all ages and their families. "
  },
  {
    "department": "NURS",
    "number": "687",
    "gen eds": "",
    "requirements": "",
    "description": "Ethical Issues in Nursing. 2 Credits. Examination and discussion of major ethical issues arising in the professional practice of nursing in the context of systematic consideration of the nature of ethical choice. "
  },
  {
    "department": "NURS",
    "number": "691H",
    "gen eds": "EE-Mentored Research. ",
    "requirements": "",
    "description": " Honors in Nursing, Part I. 3 Credits. Permission of the program director. Majors only. Preparation of a two-semester honors project under the direction of department advisors. "
  },
  {
    "department": "NURS",
    "number": "692H",
    "gen eds": "EE-Mentored Research. ",
    "requirements": "",
    "description": " Honors in Nursing, Part II. 3 Credits. Permission of the program director. Majors only. Preparation of a two-semester honors project under the direction of department advisors. "
  }
]