[
  {
    "department": "HBEH",
    "number": "396",
    "gen eds": "",
    "requirements": "",
    "description": "Independent Study in Health Behavior. 1-6 Credits. Advanced course for undergraduates who wish to pursue a topic or research study in health behavior. To be arranged with faculty. An approved work plan is required. Repeat rules: May be repeated for credit. 6 total credits. 6 total completions. "
  },
  {
    "department": "HBEH",
    "number": "561",
    "gen eds": "",
    "requirements": "",
    "description": "Environmental and Science Video Storytelling. 3 Credits. Students work in teams to produce, shoot, script, and report environmental, science, and medical stories for broadcast on \"Carolina Week\", the award-winning, student-produced television newscast. "
  },
  {
    "department": "HBEH",
    "number": "562",
    "gen eds": "",
    "requirements": "",
    "description": "Environmental and Science Documentary Television. 3 Credits. Students work in teams to conceive, produce, and script mini-documenties on environmental and science topics for broadcast on North Carolina Public Television. "
  },
  {
    "department": "HBEH",
    "number": "600",
    "gen eds": "",
    "requirements": "",
    "description": "Social and Behavioral Sciences in Public Health. 3 Credits. This course focuses on social and behavioral science theories, research and interventions aimed at promoting health of individuals, groups, communities and populations. Two lecture hours per week. Enrollment is restricted to junior, senior, graduate, and certificate students in programs or majors within the School of Public Health. "
  },
  {
    "department": "HBEH",
    "number": "601",
    "gen eds": "",
    "requirements": "",
    "description": "Principles of Statistical Inference for Health Behavior. 3 Credits. Required preparation, knowledge of basic descriptive statistics. Majors only. Major topics include elementary probability theory, probability distributions, estimation, tests of hypotheses, paired and independent samples t-tests, ANOVA, linear and logistic regression, correlation and chi-squared procedures. SAS, a statistical software package, is used in the course. "
  },
  {
    "department": "HBEH",
    "number": "610",
    "gen eds": "EE-Service Learning. ",
    "requirements": "",
    "description": "Alternative Spring Break. 2 Credits. This course will explore issues, theories, and experiences relevant to social action, coalition building, and social change. The content of this course will be examined by confronting the possibilities and limitations of service and service-learning as it relates to APPLES Alternative Spring Break experiences. "
  },
  {
    "department": "HBEH",
    "number": "611",
    "gen eds": "EE-Service Learning. ",
    "requirements": "",
    "description": "Philanthropy as a Tool for Social Change. 3 Credits. In this course students learn about and experience the process of awarding grants to local agencies. In addition to participating in the grant-making process, students learn about the nonprofit sector and the philosophy and practice of philanthropy through readings, class exercises, and guest speakers. "
  },
  {
    "department": "HBEH",
    "number": "625",
    "gen eds": "",
    "requirements": "Pre- or corequisite, EPID 600. ",
    "description": "Injury as a Public Health Problem. 1 Credit. This course considers the causes and consequences of traumatic injury and dilemmas in injury research and prevention. This one-credit course consists of 10 class sessions of 75 minutes each over the first five weeks of the semester. "
  },
  {
    "department": "HBEH",
    "number": "626",
    "gen eds": "",
    "requirements": "Corequisite, EPID 625. ",
    "description": "Intentional Injury as a Public Health Problem. 1 Credit. This one-credit course considers the causes and consequences of intentional injury and dilemmas in injury research and prevention. The course meets once a week for 75 minutes starting the sixth week of the semester. Students may enroll concurrently in EPID 627. "
  },
  {
    "department": "HBEH",
    "number": "627",
    "gen eds": "",
    "requirements": "Corequisite, EPID 625. ",
    "description": "Unintentional Injury as a Public Health Problem. 1 Credit. This one-credit course considers the causes and consequences of unintentional injury and dilemmas in injury research and prevention. The course meets once a week for 75 minutes starting the sixth week of the semester. "
  },
  {
    "department": "HBEH",
    "number": "660",
    "gen eds": "",
    "requirements": "",
    "description": "Environmental and Science Journalism. 3 Credits. Prepare students to work as environmental and science journalists. The course emphasizes writing skills in all delivery formats and interpreting environmental, science, and medical information for consumers. "
  },
  {
    "department": "HBEH",
    "number": "690",
    "gen eds": "",
    "requirements": "",
    "description": "Special Topics in Health Behavior. 1-3 Credits. Special topics in health behavior. An experimental course designed for faculty who wish to offer a new course. Content will vary from semester to semester. Repeat rules: May be repeated for credit. 6 total credits. 6 total completions. "
  },
  {
    "department": "PUBH",
    "number": "89. ",
    "gen eds": "",
    "requirements": "",
    "description": "irst-Year Seminar: Special Topics. 3 Credits. Content varies by semester. Repeat rules: May be repeated for credit; may be repeated in the same term for different topics; 6 total credits. 2 total completions. "
  },
  {
    "department": "PUBH",
    "number": "420",
    "gen eds": "",
    "requirements": "",
    "description": "The AIDS Course. 1 Credit. This course offers participants a multidisciplinary perspective on HIV/AIDS -- its etiology, immunology, epidemiology, and impact on individuals and society. How HIV/AIDS is framed by a society determines not only how affected persons are treated but also the degree to which the rights of the individual are upheld. "
  },
  {
    "department": "PUBH",
    "number": "423",
    "gen eds": "EE-Service Learning. ",
    "requirements": "",
    "description": "AIDS Service. 3 Credits. This course will integrate community service into the campus-wide AIDS course. Students will work as volunteer interns three to five hours per week for 10 weeks during the semester with Triangle-area community service organizations. "
  },
  {
    "department": "PUBH",
    "number": "450",
    "gen eds": "",
    "requirements": "",
    "description": "Data Skills Online. 1 Credit. This online, asynchronous class presents a series of discrete tools designed to teach skills to health professionals for using technology and data management/analysis. Online course. "
  },
  {
    "department": "PUBH",
    "number": "496",
    "gen eds": "",
    "requirements": "",
    "description": "Readings in Public Health Practice. 1-3 Credits. Permission of the instructor. Intensive study of a special problem in public health practice. Repeat rules: May be repeated for credit; may be repeated in the same term for different topics; 12 total credits. 4 total completions. "
  },
  {
    "department": "PUBH",
    "number": "500",
    "gen eds": "",
    "requirements": "",
    "description": "Global Health Discussion Series. 0.5 Credits. Provides opportunities for students to get to know each other through an exchange and discussion. Students exchange points of view with globally experienced faculty at UNC-Chapel Hill. "
  },
  {
    "department": "PUBH",
    "number": "510",
    "gen eds": "",
    "requirements": "",
    "description": "Interdisciplinary Perspectives in Global Health. 3 Credits. Explores issues, problems, and controversies in global health through an interdisciplinary perspective; examines the complex tapestry of social, economic, political, and environmental factors that affect global health; analyzes global health disparities through a social justice and human rights lens; and exposes students to opportunities in global health work and research. Repeat rules: May be repeated for credit.  "
  },
  {
    "department": "PUBH",
    "number": "610",
    "gen eds": "",
    "requirements": "",
    "description": "Introductory Spanish for Health Professionals. 3 Credits. This course is intended for students who know no Spanish or so little that they feel the need to start over. Students with more than two semesters of college Spanish are not eligible. The course covers the curriculum of first-semester Spanish taught within a health context, with a focus on speaking. "
  },
  {
    "department": "PUBH",
    "number": "613",
    "gen eds": "",
    "requirements": "",
    "description": "Intermediate Spanish for Health Care I. 3 Credits. This intermediate course is the equivalent of the third semester of college Spanish. Students will hone their listening and speaking skills in class primarily through role-playing activities and class discussion. Activities center on an original film set in a health clinic in rural North Carolina. "
  },
  {
    "department": "PUBH",
    "number": "615",
    "gen eds": "",
    "requirements": "",
    "description": "Advanced Spanish for Health Care I. 3 Credits. Required preparation, third semester Spanish or equivalent. This advanced course reviews the grammar of the third and fourth semester of college Spanish. Students hone their listening and speaking skills through role-playing activities and class discussion. Activities center on an original film set in a Latino-run health clinic. "
  },
  {
    "department": "PUBH",
    "number": "670",
    "gen eds": "",
    "requirements": "",
    "description": "Clinical Research Methods. 3 Credits. This course explores contemporary issues, problems, and controversies in global health through an interdisciplinary perspective. It examines the tapestry of social, economic, political, and environmental factors that affect global health. "
  },
  {
    "department": "PUBH",
    "number": "671",
    "gen eds": "",
    "requirements": "",
    "description": "Writing Scientific Research. 3 Credits. This course, Introduction to Clinical Research, is designed to give the undergraduate student an overview of clinical research methods. During the semester we will carry actual research projects. "
  },
  {
    "department": "PUBH",
    "number": "680",
    "gen eds": "",
    "requirements": "",
    "description": "Public Health Practice. 3 Credits. A comprehensive introduction to public health concepts and practice through an examination of the philosophy, purpose, history, organization, functions, tools, activities, and results of public health practice at the national, state, and community levels. Online course. "
  },
  {
    "department": "PUBH",
    "number": "690",
    "gen eds": "",
    "requirements": "",
    "description": "Special Topics in Public Health Leadership. 1-3 Credits. Permission of the instructor. Sections will focus on specific topics of current interest to health workers. Fliers describing the section offering will be distributed prior to registration each semester. Lecture hours per week dependent upon credit. Repeat rules: May be repeated for credit; may be repeated in the same term for different topics; 12 total credits. 4 total completions. "
  },
  {
    "department": "PUBH",
    "number": "696",
    "gen eds": "",
    "requirements": "",
    "description": "Independent Study. 1-3 Credits. Independent Study to address goals and objects of student. Prior faculty agreement is required. Registration for an independent study course must be completed after the learning contract has been approved and no later than the last day of \"late registration\" (the end of the first week of classes in F/S). "
  },
  {
    "department": "SPHG",
    "number": "350H",
    "gen eds": "",
    "requirements": "",
    "description": " Introduction to Public Health. 3 Credits. This introductory course will describe the history of public health, the key terms and concepts, and how the core areas of public health are integrated to promote health at a population level. The class will engage the students in active learning through the use of media, innovative technology, discussion groups, and field experiences. "
  },
  {
    "department": "SPHG",
    "number": "600",
    "gen eds": "",
    "requirements": "",
    "description": "Introduction to Public Health. 3 Credits. School of Public Health majors only. This introductory course describes the history of public health, key terms, concepts, and the integration of core areas of public health to promote health at a population level. The class engages students in active learning through the use of media, innovative technology, discussion groups, and field experiences. "
  },
  {
    "department": "SPHG",
    "number": "620",
    "gen eds": "",
    "requirements": "",
    "description": "Exploring Public Health. 1 Credit. This introductory course serves to develop a foundation in the breadth and depth of public health, locally and globally. Students will develop an understanding of the basic concepts of the public health disciplines and how they are used to promote health at a population level. "
  },
  {
    "department": "SPHG",
    "number": "690",
    "gen eds": "",
    "requirements": "",
    "description": "Special Topics in Public Health. 1-3 Credits. Topic will vary with the instructor and semester. Repeat rules: May be repeated for credit; may be repeated in the same term for different topics; 9 total credits. 3 total completions. "
  }
]